user/iani.org
#+LATEX_TEMPLATE_COPY: /Users/iani/.emacs.d/personal/user/attachments/iani/tufte-handout-fixed.tex
#+LATEX_TEMPLATE: /Users/iani/Copy/000WORKFILES/1_SNIPPETS_AND_TEMPLATES/tufte-handout-fixed.tex
* Generic Emacs Customization
** Theme (experimental)
:PROPERTIES:
:DATE:     [2014-12-02 Tue 11:21]
:END:
*** Current theme: moe-dark
#+BEGIN_SRC emacs-lisp
  (require 'moe-theme)
  (moe-dark)
#+END_SRC
*** Powerline

#+BEGIN_SRC emacs-lisp
(require 'powerline)
;; (powerline-default-theme)
(powerline-moe-theme)
#+END_SRC
*** Alternative theme: firebelly

#+BEGIN_SRC elisp
;;; Paired hl-line face background: #300
(load-theme 'firebelly)
#+END_SRC
*** Notes / other alternatives

- firebelly
- (not:) hipster (problems with elisp commented lines)


hl-line face background colors

- #300 (current)
- firebrick4

** Font (experimental)

#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist
               '(font . "Anonymous Pro-12"))

  (defun larger-frame-font ()
    (interactive)
    (set-face-attribute
     'default nil
     :height
     (+ (face-attribute 'default :height) 10)) )

  (defun smaller-frame-font ()
    (interactive)
    (set-face-attribute
     'default nil
     :height
     (- (face-attribute 'default :height) 10)) )

  (global-set-key (kbd "C-c C--") 'smaller-frame-font)
  (global-set-key (kbd "C-c C-+") 'larger-frame-font)
#+END_SRC

#+RESULTS:
: #<buffer *cfw-calendar*>

** Prelude stuff
*** Turn off guru mode
See: http://stackoverflow.com/questions/13263717/unable-to-set-off-the-guru-mode-in-emacs-prelude

#+BEGIN_SRC emacs-lisp
(guru-mode -1)
(guru-global-mode -1)
(setq prelude-guru nil)
(add-hook 'prelude-prog-mode-hook
          (lambda ()
            (guru-mode -1)) t)
#+END_SRC

*** Prelude-copy-filename-to-clipboard

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c p C-c") 'prelude-copy-file-name-to-clipboard)
#+END_SRC

** Use visible bell instead of beep

#+BEGIN_SRC emacs-lisp
(setq visible-bell t)
#+END_SRC


** Blink cursor

#+BEGIN_SRC emacs-lisp
(blink-cursor-mode 1)
#+END_SRC

** Internationalization: Set Mac OS native fonts for japanese/greek
:PROPERTIES:
:DATE:     <2013-12-08 Sun 15:12>
:END:

Here is a solution that works fine for displaying Latin, Greek and Japanese texts in the same buffer.  The Menlo font displays Greek clearly and smoothly, and since it is a mono-space font, it also works well in tables.  The two lisp expressions have to be evaluated in the following order for this to work.

_Note: This is necessary if the latin font is set to some font that does not have a full greek character set._

#+BEGIN_SRC emacs-lisp
(set-fontset-font "fontset-default"
                  'japanese-jisx0208
                  '("Hiragino Mincho Pro" . "iso10646-1"))
(set-fontset-font "fontset-default"
                  'greek
 ;; Note: iso10646-1 = Universal Character set (UCS)
 ;; It is compatible to Unicode, in its basic range
                  '("Menlo" . "iso10646-1"))
#+END_SRC

#+RESULTS:

Links for further reading:

http://sunsite.univie.ac.at/textbooks/emacs/emacs_22.html#SEC203
http://www.gnu.org/software/emacs/manual/html_node/emacs/Modifying-Fontsets.html
For Greek see: http://iris.math.aegean.gr/~atsol/emacs-unicode/

