user/iani.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>iani</title>
<!-- 2015-03-02 Mon 20:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="IOANNIS ZANNOS" />
</head>
<body>
<div id="content">
<h1 class="title">iani</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Generic Emacs Customization</a>
<ul>
<li><a href="#sec-1-1">1.1. Theme (experimental)</a></li>
<li><a href="#sec-1-2">1.2. Font (experimental)</a></li>
<li><a href="#sec-1-3">1.3. Prelude stuff</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Turn off guru mode</a></li>
<li><a href="#sec-1-3-2">1.3.2. Prelude-copy-filename-to-clipboard</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Use visible bell instead of beep</a></li>
<li><a href="#sec-1-5">1.5. Blink cursor</a></li>
<li><a href="#sec-1-6">1.6. Internationalization: Set Mac OS native fonts for japanese/greek</a></li>
<li><a href="#sec-1-7">1.7. Maximize/toggle frame</a></li>
<li><a href="#sec-1-8">1.8. Toggle visual line mode</a></li>
<li><a href="#sec-1-9">1.9. Movement: backward-sentence, forward-sentence</a></li>
<li><a href="#sec-1-10">1.10. Insert timestamp (C-c C-x t)</a></li>
<li><a href="#sec-1-11">1.11. Generic Packages</a>
<ul>
<li><a href="#sec-1-11-1">1.11.1. Require org-drill</a></li>
<li><a href="#sec-1-11-2">1.11.2. Install el-get for installing of packages from github etc.</a></li>
<li><a href="#sec-1-11-3">1.11.3. Bring elisp up-to-date: dash.el</a></li>
<li><a href="#sec-1-11-4">1.11.4. desktop</a></li>
<li><a href="#sec-1-11-5">1.11.5. breadcrumb, bookmark+</a></li>
<li><a href="#sec-1-11-6">1.11.6. Completion help: icicles, imenu+, auto-complete, ido, guide-key</a></li>
<li><a href="#sec-1-11-7">1.11.7. Buffer-move, windmove, buffer switching</a></li>
<li><a href="#sec-1-11-8">1.11.8. Completion help: icicles, imenu+, auto-complete, ido, guide-key</a></li>
<li><a href="#sec-1-11-9">1.11.9. File-system navigation: projectile, helm</a></li>
<li><a href="#sec-1-11-10">1.11.10. Note on icicle key bindings and org-mode</a></li>
<li><a href="#sec-1-11-11">1.11.11. lacarte: select menu items from the keyboard (good for org-mode with imenu)</a></li>
<li><a href="#sec-1-11-12">1.11.12. Ido-imenu command and jump back after completion, by Magnar Sveen, and others.</a></li>
<li><a href="#sec-1-11-13">1.11.13. smex (auto-complete minibuffer commands called with Meta-x)</a></li>
<li><a href="#sec-1-11-14">1.11.14. Multiple Cursors</a></li>
<li><a href="#sec-1-11-15">1.11.15. Whitespace Mode</a></li>
<li><a href="#sec-1-11-16">1.11.16. Key Chords</a></li>
<li><a href="#sec-1-11-17">1.11.17. hl-sexp mode (also: highlight-sexps)</a></li>
<li><a href="#sec-1-11-18">1.11.18. Directory/Buffer navigation: Dired+, Dirtree, Speedbar</a></li>
<li><a href="#sec-1-11-19">1.11.19. <span class="todo TODO">TODO</span> Fixme minor mode?</a></li>
<li><a href="#sec-1-11-20">1.11.20. Mac-OS extension: Open file in finder</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Customization of Specific Authoring Modes</a>
<ul>
<li><a href="#sec-2-1">2.1. Scratchbooks for coding</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. logging tryout code</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. SuperCollider</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. sclang Setup</a></li>
<li><a href="#sec-2-2-2">2.2.2. SuperCollider-specific minor modes</a></li>
<li><a href="#sec-2-2-3">2.2.3. sclang keyboard shortcuts</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Emacs Lisp</a></li>
<li><a href="#sec-2-4">2.4. html/css/js</a></li>
<li><a href="#sec-2-5">2.5. org-mode</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1. binding for org show subtree</a></li>
<li><a href="#sec-2-5-2">2.5.2. Using ido for org-goto</a></li>
<li><a href="#sec-2-5-3">2.5.3. Working with icicles/ido-menu/lacarte in org-mode and elsewhere</a></li>
<li><a href="#sec-2-5-4">2.5.4. Use visual line, whitespace and windmove in org-mode</a></li>
<li><a href="#sec-2-5-5">2.5.5. Customize Org-mode display, including todo colors</a></li>
<li><a href="#sec-2-5-6">2.5.6. Mobile Org</a></li>
<li><a href="#sec-2-5-7">2.5.7. line-&gt;headline</a></li>
<li><a href="#sec-2-5-8">2.5.8. Agenda</a></li>
<li><a href="#sec-2-5-9">2.5.9. Class and Project notes, tags, diary</a></li>
<li><a href="#sec-2-5-10">2.5.10. Org-Babel</a></li>
<li><a href="#sec-2-5-11">2.5.11. Orgmode latex customization</a></li>
<li><a href="#sec-2-5-12">2.5.12. Org-crypt: Encrypt selected org-mode entries</a></li>
<li><a href="#sec-2-5-13">2.5.13. org-reveal, ox-impress: Export slides for Reveal.js and impress.js from orgmode</a></li>
<li><a href="#sec-2-5-14">2.5.14. Folding and unfolding, selecting headings</a></li>
<li><a href="#sec-2-5-15">2.5.15. Encryption</a></li>
<li><a href="#sec-2-5-16">2.5.16. Create menu for org-mode entries (lacarte lets you reach it from the keyboard, too)</a></li>
<li><a href="#sec-2-5-17">2.5.17. Property shortcuts for collaboration: From-To</a></li>
<li><a href="#sec-2-5-18">2.5.18. <span class="done OBSOLETE">OBSOLETE</span> fname-find-file-standardized: Consistent multi-component filenames</a></li>
<li><a href="#sec-2-5-19">2.5.19. Macro: toggle drawer visibility for this section;</a></li>
<li><a href="#sec-2-5-20">2.5.20. org-export for docpad</a></li>
<li><a href="#sec-2-5-21">2.5.21. Internal: Load org-pm</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6. Magit (git for emacs) Add git repositories)</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Load Default Desktop</a></li>
<li><a href="#sec-4">4. Shell Scripts</a>
<ul>
<li><a href="#sec-4-1">4.1. Saving my config to github, bitbucket, gitlab</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Notes</a>
<ul>
<li><a href="#sec-5-1">5.1. <span class="done DONE">DONE</span> Try Orgstruct, Outshine, Outorg or Poporg for elisp files instead of Babel</a></li>
<li><a href="#sec-5-2">5.2. Capture for project logs in one folder</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1. About folder "project-logs"</a></li>
<li><a href="#sec-5-2-2">5.2.2. Methodology</a></li>
<li><a href="#sec-5-2-3">5.2.3. Keyboard shortcuts, custom functions</a></li>
<li><a href="#sec-5-2-4">5.2.4. Implementation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">6. Postamble</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Generic Emacs Customization</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Theme (experimental)</h3>
<div class="outline-text-3" id="text-1-1">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'moe-theme)
(moe-dark)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Font (experimental)</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'default-frame-alist
             '(font . "Anonymous Pro-14"))

(defun larger-frame-font ()
  (interactive)
  (set-face-attribute
   'default nil
   :height
   (+ (face-attribute 'default :height) 10)) )

(defun smaller-frame-font ()
  (interactive)
  (set-face-attribute
   'default nil
   :height
   (- (face-attribute 'default :height) 10)) )

(global-set-key (kbd "C-c C--") 'smaller-frame-font)

(global-set-key (kbd "C-c C-+") 'larger-frame-font)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Prelude stuff</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Turn off guru mode</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
See: <a href="http://stackoverflow.com/questions/13263717/unable-to-set-off-the-guru-mode-in-emacs-prelude">http://stackoverflow.com/questions/13263717/unable-to-set-off-the-guru-mode-in-emacs-prelude</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(guru-mode -1)
(guru-global-mode -1)
(setq prelude-guru nil)
(add-hook 'prelude-prog-mode-hook
          (lambda ()
            (guru-mode -1)) t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Prelude-copy-filename-to-clipboard</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "C-c p C-c") 'prelude-copy-file-name-to-clipboard)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Use visible bell instead of beep</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq visible-bell t)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Blink cursor</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(blink-cursor-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Internationalization: Set Mac OS native fonts for japanese/greek</h3>
<div class="outline-text-3" id="text-1-6">

<p>
Here is a solution that works fine for displaying Latin, Greek and Japanese texts in the same buffer.  The Menlo font displays Greek clearly and smoothly, and since it is a mono-space font, it also works well in tables.  The two lisp expressions have to be evaluated in the following order for this to work.
</p>

<p>
<span class="underline">Note: This is necessary if the latin font is set to some font that does not have a full greek character set.</span>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-fontset-font "fontset-default"
                  'japanese-jisx0208
                  '("Hiragino Mincho Pro" . "iso10646-1"))
(set-fontset-font "fontset-default"
                  'greek
 ;; Note: iso10646-1 = Universal Character set (UCS)
 ;; It is compatible to Unicode, in its basic range
                  '("Menlo" . "iso10646-1"))
</pre>
</div>

<p>
Links for further reading:
</p>

<p>
<a href="http://sunsite.univie.ac.at/textbooks/emacs/emacs_22.html#SEC203">http://sunsite.univie.ac.at/textbooks/emacs/emacs_22.html#SEC203</a>
<a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Modifying-Fontsets.html">http://www.gnu.org/software/emacs/manual/html_node/emacs/Modifying-Fontsets.html</a>
For Greek see: <a href="http://iris.math.aegean.gr/~atsol/emacs-unicode/">http://iris.math.aegean.gr/~atsol/emacs-unicode/</a>
</p>
</div>
</div>
