user/iani.el

(load-theme 'tangotango)

(require 'powerline)
(powerline-default-theme)
;; (powerline-moe-theme)

(add-to-list 'default-frame-alist
             '(font . "Anonymous Pro-12"))

(defun larger-frame-font ()
  (interactive)
  (set-face-attribute
   'default nil
   :height
   (+ (face-attribute 'default :height) 10)) )

(defun smaller-frame-font ()
  (interactive)
  (set-face-attribute
   'default nil
   :height
   (- (face-attribute 'default :height) 10)) )

(global-set-key (kbd "C-c C--") 'smaller-frame-font)
(global-set-key (kbd "C-c C-+") 'larger-frame-font)

(guru-mode -1)
(guru-global-mode -1)
(setq prelude-guru nil)
(add-hook 'prelude-prog-mode-hook
          (lambda ()
            (guru-mode -1)) t)

(global-set-key (kbd "C-c p C-c") 'prelude-copy-file-name-to-clipboard)

(setq visible-bell t)

(blink-cursor-mode 1)

(set-fontset-font "fontset-default"
                  'japanese-jisx0208
                  '("Hiragino Mincho Pro" . "iso10646-1"))
(set-fontset-font "fontset-default"
                  'greek
 ;; Note: iso10646-1 = Universal Character set (UCS)
 ;; It is compatible to Unicode, in its basic range
                  '("Menlo" . "iso10646-1"))
