user/iani.org
** Maximize/toggle frame
#+BEGIN_SRC emacs-lisp
  ;; (maximize-frame) ;; maximize frame on startup
  (defun toggle-fullscreen ()
    "Toggle full screen"
    (interactive)
    (set-frame-parameter
     nil 'fullscreen
     (when (not (frame-parameter nil 'fullscreen)) 'fullboth)))

  (tool-bar-mode -1)

  (global-set-key (kbd "H-f") 'toggle-fullscreen)

#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'maxframe) ;; (maximize-frame) command/function
#+END_SRC

#+RESULTS:
** Toggle visual line mode
:PROPERTIES:
:DATE:     <2014-11-22 Sat 10:12>
:END:

Useful for org-mode todo agenda.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "H-h v") 'visual-line-mode)
#+END_SRC
** Movement: backward-sentence, forward-sentence

Bind backward-sentence and forward-sentence in 2 different ways:

1. Control-shift-f and b in analogy to control-b/f and meta-b/f (character and word backward and forward).
2. Meta-[ and ] in analogy to Meta-shift-[ and ] (org-element backward and forward).

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-B") 'backward-sentence)
  (global-set-key (kbd "M-F") 'forward-sentence)
  (global-set-key (kbd "M-[") 'backward-sentence)
  (global-set-key (kbd "M-]") 'forward-sentence)
#+END_SRC

#+RESULTS:
: forward-sentence
** Insert timestamp (C-c C-x t)
:PROPERTIES:
:DATE:     <2014-04-07 Mon 17:35>
:END:

#+BEGIN_SRC emacs-lisp
  (defun insert-timestamp (&optional short-type)
    "Insert a timestamp."
    (interactive "P")
    (if short-type
        (insert
         (let ((date (calendar-current-date)))
           (format "%s. %s. %s"
                   (nth 1 date)
                   (nth 0 date)
                   (nth 2 date))))
     (insert (format-time-string "%a, %b %e %Y, %R %Z"))))

  (global-set-key (kbd "C-c C-x t") 'insert-timestamp)
#+END_SRC

#+RESULTS:
: insert-timestamp
** Generic Packages
*** Require org-drill
#+BEGIN_SRC emacs-lisp
(require 'org-drill)
#+END_SRC

*** Install+configure el-get for installing of packages from github etc.

See: https://github.com/dimitri/el-get/blob/master/README.md

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/el-get/el-get")

  (unless (require 'el-get nil 'noerror)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.github.com/dimitri/el-get/master/el-get-install.el")
      (goto-char (point-max))
      (eval-print-last-sexp)))

  (add-to-list 'el-get-recipe-path "~/.emacs.d/el-get-user/recipes")
  (add-to-list 'el-get-recipe-path "~/.emacs.d/personal/el-get/recipes")
  (el-get 'sync)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; load all recipes contained in .emacs.d/personal/el-get/recipes:
  (el-get 'sync
          (mapcar
           (lambda (path)
             (let ((name (file-name-nondirectory (file-name-sans-extension path))))
               (message "el-get loading: %s" name)
               name))
           (file-expand-wildcards
            (concat (file-truename (car el-get-recipe-path)) "/*.rcp"))))

#+END_SRC

#+RESULTS:
*** Bring elisp up-to-date: dash.el

#+BEGIN_QUOTE
A modern list api for Emacs. No 'cl required.
#+END_QUOTE

See: https://github.com/magnars/dash.el#functions

Used in my packages as well as in projectile and other packages.

I load it here to have it available when experimenting with code.

#+BEGIN_SRC emacs-lisp
(require 'dash)
#+END_SRC

#+RESULTS:
: dash
*** desktop
    :PROPERTIES:
    :ID:       8B25CBFB-8990-4B53-B364-967461073337
    :eval-id:  2
    :END:

Save desktop between sessions.  To clear desktop: M-x desktop-clear.

Note: As of Mon, Dec  1 2014, 11:19 EET this creates error with sentinel process on startup.  Disabled.

#+BEGIN_SRC emacs-lisp
(desktop-save-mode -1)
#+END_SRC

