user/iani.html

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Maximize/toggle frame</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; (maximize-frame) ;; maximize frame on startup
(defun toggle-fullscreen ()
  "Toggle full screen"
  (interactive)
  (set-frame-parameter
   nil 'fullscreen
   (when (not (frame-parameter nil 'fullscreen)) 'fullboth)))

(tool-bar-mode -1)

(global-set-key (kbd "H-f") 'toggle-fullscreen)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-elisp">(toggle-fullscreen)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'maxframe) ;; (maximize-frame) command/function
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Toggle visual line mode</h3>
<div class="outline-text-3" id="text-1-8">

<p>
Useful for org-mode todo agenda.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "H-h v") 'visual-line-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Movement: backward-sentence, forward-sentence</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Bind backward-sentence and forward-sentence in 2 different ways:
</p>

<ol class="org-ol">
<li>Control-shift-f and b in analogy to control-b/f and meta-b/f (character and word backward and forward).
</li>
<li>Meta-[ and ] in analogy to Meta-shift-[ and ] (org-element backward and forward).
</li>
</ol>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "M-B") 'backward-sentence)
(global-set-key (kbd "M-F") 'forward-sentence)
(global-set-key (kbd "M-[") 'backward-sentence)
(global-set-key (kbd "M-]") 'forward-sentence)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Insert timestamp (C-c C-x t)</h3>
<div class="outline-text-3" id="text-1-10">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun insert-timestamp (&amp;optional short-type)
  "Insert a timestamp."
  (interactive "P")
  (if short-type
      (insert
       (let ((date (calendar-current-date)))
         (format "%s. %s. %s"
                 (nth 1 date)
                 (nth 0 date)
                 (nth 2 date))))
   (insert (format-time-string "%a, %b %e %Y, %R %Z"))))

(global-set-key (kbd "C-c C-x t") 'insert-timestamp)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> Generic Packages</h3>
<div class="outline-text-3" id="text-1-11">
</div><div id="outline-container-sec-1-11-1" class="outline-4">
<h4 id="sec-1-11-1"><span class="section-number-4">1.11.1</span> Require org-drill</h4>
<div class="outline-text-4" id="text-1-11-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'org-drill)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-2" class="outline-4">
<h4 id="sec-1-11-2"><span class="section-number-4">1.11.2</span> Install el-get for installing of packages from github etc.</h4>
<div class="outline-text-4" id="text-1-11-2">
<p>
See: <a href="https://github.com/dimitri/el-get/blob/master/README.md">https://github.com/dimitri/el-get/blob/master/README.md</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path "~/.emacs.d/el-get/el-get")

(unless (require 'el-get nil 'noerror)
  (with-current-buffer
      (url-retrieve-synchronously
       "https://raw.github.com/dimitri/el-get/master/el-get-install.el")
    (goto-char (point-max))
    (eval-print-last-sexp)))

(add-to-list 'el-get-recipe-path "~/.emacs.d/el-get-user/recipes")
(el-get 'sync)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-11-3" class="outline-4">
<h4 id="sec-1-11-3"><span class="section-number-4">1.11.3</span> Bring elisp up-to-date: dash.el</h4>
<div class="outline-text-4" id="text-1-11-3">
<blockquote>
<p>
A modern list api for Emacs. No 'cl required.
</p>
</blockquote>

<p>
See: <a href="https://github.com/magnars/dash.el#functions">https://github.com/magnars/dash.el#functions</a>
</p>

<p>
Used in my packages as well as in projectile and other packages.
</p>

<p>
I load it here to have it available when experimenting with code.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'dash)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-11-4" class="outline-4">
<h4 id="sec-1-11-4"><a id="ID-8B25CBFB-8990-4B53-B364-967461073337" name="ID-8B25CBFB-8990-4B53-B364-967461073337"></a><span class="section-number-4">1.11.4</span> desktop</h4>
<div class="outline-text-4" id="text-1-11-4">

<p>
Save desktop between sessions.  To clear desktop: M-x desktop-clear.
</p>

<p>
Note: As of Mon, Dec  1 2014, 11:19 EET this creates error with sentinel process on startup.  Disabled.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(desktop-save-mode 1)
</pre>
</div>
</div>
</div>
