user/iani.el

;; (maximize-frame) ;; maximize frame on startup
(defun toggle-fullscreen ()
  "Toggle full screen"
  (interactive)
  (set-frame-parameter
   nil 'fullscreen
   (when (not (frame-parameter nil 'fullscreen)) 'fullboth)))

(tool-bar-mode -1)

(global-set-key (kbd "H-f") 'toggle-fullscreen)

(require 'maxframe) ;; (maximize-frame) command/function

(global-set-key (kbd "H-h v") 'visual-line-mode)

(global-set-key (kbd "M-B") 'backward-sentence)
(global-set-key (kbd "M-F") 'forward-sentence)
(global-set-key (kbd "M-[") 'backward-sentence)
(global-set-key (kbd "M-]") 'forward-sentence)

(defun insert-timestamp (&optional short-type)
  "Insert a timestamp."
  (interactive "P")
  (if short-type
      (insert
       (let ((date (calendar-current-date)))
         (format "%s. %s. %s"
                 (nth 1 date)
                 (nth 0 date)
                 (nth 2 date))))
   (insert (format-time-string "%a, %b %e %Y, %R %Z"))))

(global-set-key (kbd "C-c C-x t") 'insert-timestamp)

(require 'org-drill)

(add-to-list 'load-path "~/.emacs.d/el-get/el-get")

(unless (require 'el-get nil 'noerror)
  (with-current-buffer
      (url-retrieve-synchronously
       "https://raw.github.com/dimitri/el-get/master/el-get-install.el")
    (goto-char (point-max))
    (eval-print-last-sexp)))

(add-to-list 'el-get-recipe-path "~/.emacs.d/el-get-user/recipes")
(add-to-list 'el-get-recipe-path "~/.emacs.d/personal/el-get/recipes")
(el-get 'sync)

;; load all recipes contained in .emacs.d/personal/el-get/recipes:
(el-get 'sync
        (mapcar
         (lambda (path)
           (let ((name (file-name-nondirectory (file-name-sans-extension path))))
             (message "el-get loading: %s" name)
             name))
         (file-expand-wildcards
          (concat (file-truename (car el-get-recipe-path)) "/*.rcp"))))

(require 'dash)

(desktop-save-mode -1)
