user/iani.org
*** breadcrumb, bookmark+
:PROPERTIES:
:ID:       FFED8BC2-0CE8-4BA0-ABC2-1AE9B4EFFFF3
:eval-id:  3
:END:

See: http://breadcrumbemacs.sourceforge.net/news.html

#+BEGIN_SRC emacs-lisp
  (require 'breadcrumb)

  ;; (global-set-key [(shift space)]         'bc-set)              ;;  Shift-SPACE for set bookmark
  (global-set-key (kbd "H-S-SPC")            'bc-set) ;; Hyper-Shift-SPACE for set bookmark
  (global-set-key [(meta j)]              'bc-previous)       ;; M-j for jump to previous
  (global-set-key [(shift meta j)]        'bc-next)           ;; Shift-M-j for jump to next
  (global-set-key [(meta up)]             'bc-local-previous) ;; M-up-arrow for local previous
  (global-set-key [(meta down)]           'bc-local-next)     ;; M-down-arrow for local next
  (global-set-key [(control c)(j)]        'bc-goto-current)   ;; C-c j for jump to current bookmark
  (global-set-key [(control x)(meta j)]   'bc-list)           ;; C-x M-j for the bookmark menu list
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (require 'desktop)
  (require 'bookmark+)

  (setq bookmark-default-file
        "~/.emacs.d/personal/bookmarks/default-bookmarks.bmk")

  (defun bookmark-save-named (&optional name)
    "mod of bookmark-save to save bookmark under name
  in one default directory in users prelude folder."
    (interactive "Mbookmark filename: ~/.emacs.d/personal/bookmarks/: ")
    (let ((path
           (file-truename
            (concat
             "~/.emacs.d/personal/bookmarks/"
             (replace-regexp-in-string "/" "_" name)
             ".bmk"))))
      (setq bmkp-current-bookmark-file path)
      (bookmark-save)))

  (global-set-key (kbd "C-x r C-s") 'bookmark-save-named)

  (defun bmkp-desktop-save-named (&optional name)
    "mod of bmkp-desktop-save to save desktop bookmark under name
  in under one default directory in users prelude folder."
    (interactive "MSave desktop ~/.emacs/personal/bookmarks/desktops/?: ")
    (let ((path
           (file-truename
            (concat
             "~/.emacs.d/personal/bookmarks/desktops/"
             (replace-regexp-in-string "/" "_" name)
             ".desktop"))))
      (bmkp-desktop-save path)
      (let ((bookmark-make-record-function
             (lexical-let ((df path))
               (lambda () (bmkp-make-desktop-record df))))
            (current-prefix-arg 99)) ; Use all bookmarks for completion, for `bookmark-set'.
        (bookmark-set name))))

  (defun bmkp-load-auto-saved-desktop ()
    (interactive)
  ;;  (bookmark-bmenu-list) ;; needed to update list if never loaded
    (bmkp-desktop-jump "auto-save-desktop"))

  (add-hook 'kill-emacs-hook
            (lambda () (bmkp-desktop-save-named "auto-save-desktop")))

  (global-set-key (kbd "C-x r C-k") 'bmkp-desktop-save-named)
  (global-set-key (kbd "C-x p r") 'bookmark-rename)
  (define-key bookmark-bmenu-mode-map "r" 'bookmark-rename)
  (global-set-key (kbd "C-x j M-k") 'bmkp-load-auto-saved-desktop)

  (bookmark-bmenu-list) ;; make sure bookmark list is loaded
#+END_SRC

*** Completion help: icicles, imenu+, auto-complete, ido, guide-key

#+BEGIN_SRC emacs-lisp
  (require 'ido)
  (require 'flx-ido)
  (require 'imenu+)
  (require 'auto-complete)
  (ido-mode t)
  (ido-vertical-mode t)
  (icicle-mode) ;; breaks dired? Tue, Nov  4 2014, 19:17 EET
  ;; guide-key causes erratic delays when posting in ths SC post buffer
  ;; from sclang.  Therefore disabled.
  ;; (require 'guide-key)
  ;; (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "H-h" "H-m" "H-p" "H-d" "C-c"))
  ;;  (guide-key-mode 1)  ; Enable guide-key-mode
  ;; (yas-global-mode) ; interferes with auto-complete in elisp mode.
#+END_SRC

*** Buffer-move, windmove, buffer switching

- windmove (package) :: Use cursor keys to switch cursor position between windows.  Bound to =control-super-<cursorkey>=. (Super is the "Apple/cmd" key on Mac keyboards or the "Windows" key on MS keyboards.
- buffer-move (package) :: Use cursor keys to switch buffer position between windows.  Bound to =fn-shift-<cursor key>=.
- next-buffer, previous-buffer (built-in commands) :: Use cursor keys to switch to previous/next buffer in same window.

#+BEGIN_SRC emacs-lisp
  (require 'windmove)
  (global-set-key (kbd "H-{") 'windmove-up)
  (global-set-key (kbd "<C-s-up>") 'windmove-up)
  (global-set-key (kbd "<C-prior>") 'windmove-up)
  (global-set-key (kbd "H-}") 'windmove-down)
  (global-set-key (kbd "<C-s-down>") 'windmove-down)
  (global-set-key (kbd "<C-next>") 'windmove-down)
  (global-set-key (kbd "H-]") 'windmove-right)
  (global-set-key (kbd "<C-s-right>") 'windmove-right)
  (global-set-key (kbd "<C-end>") 'windmove-right)
  (global-set-key (kbd "H-[") 'windmove-left)
  (global-set-key (kbd "<C-s-left>") 'windmove-left)
  (global-set-key (kbd "<C-home>") 'windmove-left)

  (require 'buffer-move)
  (global-set-key (kbd "<S-prior>") 'buf-move-up)
  (global-set-key (kbd "<S-next>") 'buf-move-down)
  (global-set-key (kbd "<S-end>") 'buf-move-right)
  (global-set-key (kbd "<S-home>") 'buf-move-left)

  (global-set-key (kbd "<s-home>") 'previous-buffer)
  (global-set-key (kbd "<s-end>") 'next-buffer)

  ;; Alternatives for apple extended keyboard
  (global-set-key (kbd "<f13> <up>") 'buf-move-up)
  (global-set-key (kbd "<f13> <down>") 'buf-move-down)
  (global-set-key (kbd "<f13> <left>") 'buf-move-left)
  (global-set-key (kbd "<f13> <right>") 'buf-move-right)

#+END_SRC

**** TODO write overview of window moving commands

- Switching cursor between buffers :: ...
- Switching buffers in windows ::
- Moving cursor in current buffer ::
- Moving cursor in other buffer ::


