user/iani.html
<div id="outline-container-sec-1-11-8" class="outline-4">
<h4 id="sec-1-11-8"><span class="section-number-4">1.11.8</span> Completion help: icicles, imenu+, auto-complete, ido, guide-key</h4>
<div class="outline-text-4" id="text-1-11-8">
<div class="org-src-container">

<pre class="src src-elisp">(require 'ido)
(require 'flx-ido)
(require 'imenu+)
(require 'auto-complete)
(ido-mode t)
(ido-vertical-mode t)
(icicle-mode)
;; guide-key causes erratic delays when posting in ths SC post buffer
;; from sclang.  Therefore disabled.
;; (require 'guide-key)
;; (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "H-h" "H-m" "H-p" "H-d" "C-c"))
;;  (guide-key-mode 1)  ; Enable guide-key-mode
;; (yas-global-mode) ; interferes with auto-complete in elisp mode.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-9" class="outline-4">
<h4 id="sec-1-11-9"><span class="section-number-4">1.11.9</span> File-system navigation: projectile, helm</h4>
<div class="outline-text-4" id="text-1-11-9">
</div><ol class="org-ol"><li><a id="sec-1-11-9-1" name="sec-1-11-9-1"></a>projectile<br  /><div class="outline-text-5" id="text-1-11-9-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq projectile-completion-system 'grizzl)
(setq *grizzl-read-max-results* 40)
(defun projectile-dired-project-root ()
  "Dired root of current project.  Can be set as value of
projectile-switch-project-action to dired root of project when switching.
Note: projectile-find-dir (with grizzl) does not do this, but it
asks to select a *subdir* of selected project to dired."
  (interactive)
  (dired (projectile-project-root)))

(setq projectile-switch-project-action 'projectile-commander)

(defun projectile-post-project ()
  "Which project am I actually in?"
  (interactive)
  (message (projectile-project-root)))

(defun projectile-add-project ()
  "Add folder of current buffer's file to list of projectile projects"
  (interactive)
  (if (buffer-file-name (current-buffer))
      (projectile-add-known-project
       (file-name-directory (buffer-file-name (current-buffer))))))

(global-set-key (kbd "H-p c") 'projectile-commander)
(global-set-key (kbd "H-p h") 'helm-projectile)
(global-set-key (kbd "H-p s") 'projectile-switch-project)
(global-set-key (kbd "H-p d") 'projectile-find-dir)
(global-set-key (kbd "H-p f") 'projectile-find-file)
(global-set-key (kbd "H-p w") 'projectile-post-project)
(global-set-key (kbd "H-p D") 'projectile-dired-project-root)
(global-set-key (kbd "H-p +") 'projectile-add-project)
(global-set-key (kbd "H-p -") 'projectile-remove-known-project)
(global-set-key (kbd "H-p a") 'projectile-ack) ;; better search than grep
</pre>
</div>
</div>
</li>
