user/iani.html

<li><a id="sec-1-11-9-2" name="sec-1-11-9-2"></a>helm<br  /><div class="outline-text-5" id="text-1-11-9-2">
<p>
NOTE: helm-swoop must be installed from:
<a href="https://raw.github.com/ShingoFukuyama/helm-swoop/master/helm-swoop.el">https://raw.github.com/ShingoFukuyama/helm-swoop/master/helm-swoop.el</a>
or
<a href="https://raw.github.com/ShingoFukuyama/helm-swoop/">https://raw.github.com/ShingoFukuyama/helm-swoop/</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">    ;; must call these to initialize  helm-source-find-files

    (require 'helm-files) ;; (not auto-loaded by system!)
;;    (require 'helm-projectile)
    (require 'helm-swoop) ;; must be put into packages
    ;; Don't bicker if not in a project:
    (setq projectile-require-project-root)

    ;; Added by IZ following this:
    ;; https://github.com/emacs-helm/helm/issues/604
    ;; :

    (add-hook 'helm-find-files-before-init-hook
              (lambda ()
                (progn
                  ;; List Hg files in project.
                  (helm-add-action-to-source-if
                   "Hg list files"
                   'helm-ff-hg-find-files
                   helm-source-find-files
                   'helm-hg-root-p)
                  ;; Byte compile files async
                  (helm-add-action-to-source-if
                   "Byte compile file(s) async"
                   'async-byte-compile-file
                   helm-source-find-files
                   'helm-ff-candidates-lisp-p)
                  ;; Add add-to-projectile action after helm-find-files.
                  (let ((find-files-action (assoc 'action helm-source-find-files)))
                    (setcdr find-files-action
                            (cons
                             (cadr find-files-action)
                             (cons '("Add to projectile" . helm-add-to-projectile)
                                   (cddr find-files-action))))))))

    ;; Use helm-find-files actions in helm-projectile
 ;;   (let ((projectile-files-action (assoc 'action helm-source-projectile-files-list)))
 ;;       (setcdr projectile-files-action (cdr (assoc 'action helm-source-find-files))))

    (defun helm-add-to-projectile (path)
      "Add directory of file to projectile projects.
    Used as helm action in helm-source-find-files"
      (projectile-add-known-project (file-name-directory path)))

    (global-set-key (kbd "H-h p") 'helm-projectile)
    (global-set-key (kbd "H-h g") 'helm-do-grep)
    (global-set-key (kbd "H-h f") 'helm-find-files)
    (global-set-key (kbd "H-h r") 'helm-resume)
    (global-set-key (kbd "H-h b") 'helm-bookmarks)
    (global-set-key (kbd "H-h l") 'helm-buffers-list)
    (global-set-key (kbd "H-M-h") 'helm-M-x)
    (global-set-key (kbd "H-h w") 'helm-world-time)
    (global-set-key (kbd "H-h s") 'helm-swoop)
    (global-set-key (kbd "C-c m") 'helm-mini)

    (setq display-time-world-list
          '(("America/Los_Angeles" "Santa Barbara")
            ("America/New_York" "New York")
            ("Europe/London" "London")
            ("Europe/Lisbon" "Lisboa")
            ("Europe/Madrid" "Barcelona")
            ("Europe/Paris" "Paris")
            ("Europe/Berlin" "Berlin")
            ("Europe/Rome" "Rome")
            ;; ("Europe/Albania" "Gjirokastra") ;; what city to name here?
            ("Europe/Athens" "Athens")
            ("Asia/Calcutta" "Kolkatta")
            ("Asia/Jakarta" "Jakarta")
            ("Asia/Shanghai" "Shanghai")
            ("Asia/Tokyo" "Tokyo")))
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-11-10" class="outline-4">
<h4 id="sec-1-11-10"><span class="section-number-4">1.11.10</span> Note on icicle key bindings and org-mode</h4>
<div class="outline-text-4" id="text-1-11-10">
<p>
C-c ' in org mode runs the command org-edit-special, for editing babel commands and other blocks.  To avoid conflict with icicles binding of the same key to icicle-occur, remap the latter to something else (e.g. C-c C-M-'), like this:
</p>
<ol class="org-ol">
<li>type M-x customize-group &lt;RET&gt; Icicles-Key-Bindings &lt;RET&gt;
</li>
<li>Scroll down to Icicle Top Level Key Bindings, open the list, find icicle-occur, enter C-c C-M-' to the <code>Key:</code> field, go to top of buffer, use the <code>State</code> button to save this.
</li>
</ol>

<p>
See also discussion here: <a href="http://www.emacswiki.org/emacs/Icicles_-_Key_Binding_Discussion">http://www.emacswiki.org/emacs/Icicles_-_Key_Binding_Discussion</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-11-11" class="outline-4">
<h4 id="sec-1-11-11"><span class="section-number-4">1.11.11</span> lacarte: select menu items from the keyboard (good for org-mode with imenu)</h4>
<div class="outline-text-4" id="text-1-11-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'lacarte)
;; (global-set-key [?\e ?\M-x] 'lacarte-execute-command)
</pre>
</div>
</div>
</div>
