user/iani.html

<div id="outline-container-sec-1-11-12" class="outline-4">
<h4 id="sec-1-11-12"><span class="section-number-4">1.11.12</span> Ido-imenu command and jump back after completion, by Magnar Sveen, and others.</h4>
<div class="outline-text-4" id="text-1-11-12">
<p>
Disabled.
</p>

<div class="org-src-container">

<pre class="src src-elisp">;;; ido-imenu
(defun ido-imenu ()
  "Update the imenu index and then use ido to select a symbol to navigate to.
Symbols matching the text at point are put first in the completion list."
  (interactive)
  (imenu--make-index-alist)
  (let ((name-and-pos '())
        (symbol-names '()))
    (flet ((addsymbols
          (symbol-liost)
          (when (listp symbol-list)
            (dolist (symbol symbol-list)
              (let ((name nil) (position nil))
                (cond
                 ((and (listp symbol) (imenu--subalist-p symbol))
                  (addsymbols symbol))

                 ((listp symbol)
                  (setq name (car symbol))
                  (setq position (cdr symbol)))

                 ((stringp symbol)
                  (setq name symbol)
                  (setq position
                        (get-text-property 1 'org-imenu-marker symbol))))

                (unless (or (null position) (null name))
                  (add-to-list 'symbol-names name)
                  (add-to-list 'name-and-pos (cons name position))))))))
      (addsymbols imenu--index-alist))
;; If there are matching symbols at point, put them at the beginning of `symbol-names'.
    (let ((symbol-at-point (thing-at-point 'symbol)))
      (when symbol-at-point
        (let* ((regexp (concat (regexp-quote symbol-at-point) "$"))
               (matching-symbols
                (delq nil (mapcar (lambda (symbol)
                                    (if (string-match regexp symbol) symbol))
                                  symbol-names))))
          (when matching-symbols
            (sort matching-symbols (lambda (a b) (&gt; (length a) (length b))))
            (mapc
             (lambda (symbol)
               (setq symbol-names (cons symbol (delete symbol symbol-names))))
             matching-symbols)))))
    (let* ((selected-symbol (ido-completing-read "Symbol? " symbol-names))
           (position (cdr (assoc selected-symbol name-and-pos))))
      (goto-char position))))

;; Push mark when using ido-imenu

(defvar push-mark-before-goto-char nil)

(defadvice goto-char (before push-mark-first activate)
  (when push-mark-before-goto-char
    (push-mark)))

(defun ido-imenu-push-mark ()
  (interactive)
  (let ((push-mark-before-goto-char t))
    (ido-imenu)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-13" class="outline-4">
<h4 id="sec-1-11-13"><span class="section-number-4">1.11.13</span> smex (auto-complete minibuffer commands called with Meta-x)</h4>
<div class="outline-text-4" id="text-1-11-13">

<p>
Note: since March 2014 I mostly use helm-M-x (bound to Hyper-meta-x) instead of Meta-x, so smex is not crucial.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; Smex: Autocomplete meta-x command
(global-set-key [(meta x)]
                (lambda ()
                  (interactive)
                  (or (boundp 'smex-cache)
                      (smex-initialize))
                  (global-set-key [(meta x)] 'smex)
                  (smex)))

(global-set-key [(shift meta x)]
                (lambda ()
                  (interactive)
                  (or (boundp 'smex-cache)
                      (smex-initialize))
                  (global-set-key [(shift meta x)] 'smex-major-mode-commands)
                  (smex-major-mode-commands)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-14" class="outline-4">
<h4 id="sec-1-11-14"><span class="section-number-4">1.11.14</span> Multiple Cursors</h4>
<div class="outline-text-4" id="text-1-11-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'multiple-cursors)
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-set-key (kbd "C-&gt;") 'mc/mark-next-like-this)
(global-set-key (kbd "C-&lt;") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-M-&gt;") 'mc/mark-more-like-this-extended)
(global-set-key (kbd "C-c C-&lt;") 'mc/mark-all-like-this)
;; (global-set-key (kbd "C-&gt;") 'mc/mark-next-symbol-like-this)
;; (global-set-key (kbd "C-&gt;") 'mc/mark-next-word-like-this)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-15" class="outline-4">
<h4 id="sec-1-11-15"><span class="section-number-4">1.11.15</span> Whitespace Mode</h4>
<div class="outline-text-4" id="text-1-11-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun turn-off-whitespace-mode () (whitespace-mode -1))
(defun turn-on-whitespace-mode () (whitespace-mode 1))
</pre>
</div>
</div>
</div>
