user/iani.html

<div id="outline-container-sec-1-11-16" class="outline-4">
<h4 id="sec-1-11-16"><span class="section-number-4">1.11.16</span> Key Chords</h4>
<div class="outline-text-4" id="text-1-11-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'key-chord)
(key-chord-mode 1)

(defun paren-sexp ()
  (interactive)
  (insert "(")
  (forward-sexp)
  (insert ")"))

(defun code-quote-sexp ()
  (interactive)
  (insert "=")
  (forward-sexp)
  (insert "="))

(key-chord-define-global "jk"     'ace-jump-char-mode)
(key-chord-define-global "jj"     'ace-jump-word-mode)
(key-chord-define-global "jl"     'ace-jump-line-mode)

(key-chord-define-global "hj"     'undo)

(key-chord-define-global "{}"     "{   }\C-b\C-b\C-b")
(key-chord-define-global "()"     'paren-sexp)
(key-chord-define-global "(_"     "()\C-b")
(key-chord-define-global "-="     'code-quote-sexp)
;; to add: quote, single quote around word/sexp
;; Exit auto-complete, keeping the current selection,
;; while avoiding possible side-effects of TAB or RETURN.
(key-chord-define-global "KK"      "\C-f\C-b")
;; Trick for triggering yasnippet when using in tandem with auto-complete:
;; Move forward once to get out of auto-complete, then backward once to
;; end of keyword, and enter tab to trigger yasnippet.
(key-chord-define-global "KL"      "\C-f\C-b\C-i")

;; Jump to any symbol in buffer using ido-imenu
(key-chord-define-global "KJ"      'ido-imenu)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-17" class="outline-4">
<h4 id="sec-1-11-17"><span class="section-number-4">1.11.17</span> hl-sexp mode (also: highlight-sexps)</h4>
<div class="outline-text-4" id="text-1-11-17">
<p>
Highlight expressions enclosed by (), {} or [] in code.
</p>

<p>
There exist 2 versions:
</p>

<ol class="org-ol">
<li>hl-sexp package available from elpa.
Package name: hl-sexp
Mode name: hl-sexp-mode
</li>
<li>highlight-sexps.el, from <a href="http://www.emacswiki.org/emacs/HighlightSexp">http://www.emacswiki.org/emacs/HighlightSexp</a>.
Package name: highlight-sexps
Mode name: highlight-sexps-mode
</li>
</ol>

<p>
highlight-sexps.el looks nicer, because it highlights both the innermost s-expression and the one enclosing it, and it does not un-highlight the line where the cursor is on.  But it sometimes stops working.  So I use hl-sexp
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'hl-sexp)
;; (require 'highlight-sexps)
;; Include color customization for dark color theme here.
(custom-set-variables
 '(hl-sexp-background-colors (quote ("gray0"  "#0f003f"))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-18" class="outline-4">
<h4 id="sec-1-11-18"><span class="section-number-4">1.11.18</span> Directory/Buffer navigation: Dired+, Dirtree, Speedbar</h4>
<div class="outline-text-4" id="text-1-11-18">
</div><ol class="org-ol"><li><a id="sec-1-11-18-1" name="sec-1-11-18-1"></a>Dired+, Dirtree, Speedbar<br  /><div class="outline-text-5" id="text-1-11-18-1">
<p>
Note about dirtree:  Very handy.  There are several versions out there, and there is also a different package under the same name.  Not all versions work.  This one works for me: <a href="https://github.com/rtircher/dirtree">https://github.com/rtircher/dirtree</a>.  I installed it manually (not via <code>el-get</code>, el-get's registered versions of dirtree resulted in conflicts.  Dirtree is similar to file-browse mode of speedbar, but it servers a different purpose: With dirtree you can select one or more directories to browse, and keep them all in the sidebar.  Speedbar always shows only the directory of the file of the current buffer.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;;  (require 'dired+)
  (require 'dirtree)
  (global-set-key (kbd "H-d d") 'dirtree-show)
  ;; sr-speedbar is broken in emacs 24.4.1
  ;; (require 'sr-speedbar)
  ;; (speedbar-add-supported-extension ".sc")
  ;; (speedbar-add-supported-extension ".scd")
  ;; (global-set-key (kbd "H-d H-s") 'sr-speedbar-toggle)
</pre>
</div>
</div>
</li>

<li><a id="sec-1-11-18-2" name="sec-1-11-18-2"></a>Open pdf files with default macos app in dired<br  /><div class="outline-text-5" id="text-1-11-18-2">

<p>
From: <a href="http://stackoverflow.com/questions/20019732/define-keybinding-for-dired-to-run-a-command-open-on-the-file-under-the-cur">http://stackoverflow.com/questions/20019732/define-keybinding-for-dired-to-run-a-command-open-on-the-file-under-the-cur</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key dired-mode-map (kbd "&lt;SPC&gt;")
  (lambda () (interactive)
    (let ((lawlist-filename (dired-get-file-for-visit)))
      (if (equal (file-name-extension lawlist-filename) "pdf")
          (start-process "default-pdf-app" nil "open" lawlist-filename)))))
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-11-19" class="outline-4">
<h4 id="sec-1-11-19"><span class="section-number-4">1.11.19</span> <span class="todo TODO">TODO</span> Fixme minor mode?</h4>
<div class="outline-text-4" id="text-1-11-19">
<p>
<a href="http://www.emacswiki.org/emacs/FixmeMode">http://www.emacswiki.org/emacs/FixmeMode</a>
<a href="http://www.emacswiki.org/emacs/fixme-mode.el">http://www.emacswiki.org/emacs/fixme-mode.el</a>
</p>

<p>
Or see: hl-todo, and further packages like it, listed in hl-todo Help file:
</p>

<ul class="org-ul">
<li><a href="http://emacswiki.org/fic-ext-mode.el">fic-ext-mode</a>
</li>
<li><a href="https://github.com/lewang/fic-mode">fic-mode</a>
</li>
<li><a href="http://emacswiki.org/FixmeMode">fixme-mode</a>
</li>
<li><a href="https://github.com/rolandwalker/fixmee">fixmee</a>
</li>
<li>see <a href="http://emacswiki.org/FixmeMode">http://emacswiki.org/FixmeMode</a> for more alternatives
</li>
</ul>

<p>
If you like this you might also like <a href="https://github.com/tarsius/orglink">orglink</a>.
</p>
</div>
</div>
