user/iani.html
<div id="outline-container-sec-1-11-20" class="outline-4">
<h4 id="sec-1-11-20"><span class="section-number-4">1.11.20</span> Mac-OS extension: Open file in finder</h4>
<div class="outline-text-4" id="text-1-11-20">
<p>
From: <a href="http://stackoverflow.com/questions/20510333/in-emacs-how-to-show-current-file-in-finder">http://stackoverflow.com/questions/20510333/in-emacs-how-to-show-current-file-in-finder</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun open-finder ()
  (interactive)
  ;; IZ Dec 25, 2013 (3:25 PM): Making this work in dired:
  (if (equal major-mode 'dired-mode)
      (open-finder-dired)
      (let ((path
             (if (equal major-mode 'dired-mode)
                 (file-truename (dired-file-name-at-point))
               (buffer-file-name)))
            dir file)
        (when path
          (setq dir (file-name-directory path))
          (setq file (file-name-nondirectory path))
          (open-finder-1 dir file)))))

(defun open-finder-1 (dir file)
  (message "open-finder-1 dir: %s\nfile: %s" dir file)
  (let ((script
         (if file
             (concat
              "tell application \"Finder\"\n"
              " set frontmost to true\n"
              " make new Finder window to (POSIX file \"" dir "\")\n"
              " select file \"" file "\"\n"
              "end tell\n")
           (concat
            "tell application \"Finder\"\n"
            " set frontmost to true\n"
            " make new Finder window to {path to desktop folder}\n"
            "end tell\n"))))
    (start-process "osascript-getinfo" nil "osascript" "-e" script)))

;; own mod
(defun open-folder-in-finder (&amp;optional dir)
  (interactive "DSelect folder:")
  (setq dir (expand-file-name dir))
  (let ((script
         (concat
          "tell application \"Finder\"\n"
          " set frontmost to true\n"
          " make new Finder window to (POSIX file \"" dir "\")\n"
          "end tell\n")))
    (start-process "osascript-getinfo" nil "osascript" "-e" script)))

(global-set-key (kbd "H-o") 'open-folder-in-finder)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Customization of Specific Authoring Modes</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Scratchbooks for coding</h3>
