user/iani.html
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><a id="ID-6D2D4561-1856-4EA9-962E-0B556A95F7F5" name="ID-6D2D4561-1856-4EA9-962E-0B556A95F7F5"></a><span class="section-number-4">2.1.1</span> logging tryout code</h4>
<div class="outline-text-4" id="text-2-1-1">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defvar scratchpad-main-directory "1_SCRIPTS")

(defvar scratchpad-languages
  '(("emacslisp" .
               (:extension "el" :template-func make-el-template))
    ("supercollider" .
                   (:extension "scd" :template-func make-sc-template))
    ("markdown" .
     (:extension "md" :template-func make-md-template))
    ("shell" .
     (:extension "sh" :template-func make-sh-template))
    ("git" .
     (:extension "sh" :template-func make-sh-template))
    ("org-mode" .
     (:extension "org" :template-func make-org-template))))

(defun iz-scratchpad-menu (&amp;optional folderp)
  (interactive "P")
  (let* ((menu (grizzl-make-index (mapcar 'car scratchpad-languages)))
         (language (grizzl-completing-read "Select language: " menu))
         (language-plist (cdr (assoc language scratchpad-languages))))
    (if folderp
        (dirtree (scratchpad-make-folder-name language) t)
      (apply
       (plist-get language-plist :template-func)
       (list
        language
        (read-no-blanks-input "Title? (only alpha-numeric, - and _ chars): " "")
        (plist-get language-plist :extension))))))

(file-name-sans-extension "/test/abcd.efgh")

(defun make-el-template (folder title extension)
  (let* (
         (full-path (scratchpad-make-full-path folder title extension))
         (file-name (file-name-nondirectory full-path))
         (package-name (file-name-sans-extension file-name)))
    (find-file full-path)
    (insert
     (concat
      ";;; package --- Summary\n\n"
      ";;; Commentary:\n\n"
      ";;; Code:\n\n()\n\n"
      ";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n"
      "(provide '" package-name
      ")\n;;; " file-name " ends here"
      ))
    (goto-char 0)
    (search-forward "\(\)")
    (backward-char 1)))

(defun scratchpad-make-full-path (folder title extension)
  (concat (scratchpad-make-folder-name folder)
          (scratchpad-make-file-name title extension)))

(defun scratchpad-make-file-name (file-name extension)
  (concat title
          (format-time-string "_%y%m%d_%H-%M" (current-time))
          "."
          extension))

(defun scratchpad-find-file (folder file-name)
  (find-file (concat (scratchpad-make-folder-name folder) file-name)))

(defun scratchpad-make-folder-name (folder)
  (concat iz-log-dir scratchpad-main-directory "/" folder "-scratchpad/"))

(defun make-sc-template (folder title &amp;optional extension)
  (unless extension (setq extension "scd"))
  (find-file
   (scratchpad-make-full-path folder title extension))
  (insert
   (concat "/* " (format-time-string "%c %Z") " */\n\n"
           "(\nServer.default.boot;\n)\n//:\n(\n"
           "~mySound = { | amp = 0.1 | WhiteNoise.ar(amp) }.play;\n)"
           ))
  (unless (sclang-get-process) (sclang-start)))

(defun make-md-template (folder title &amp;optional extension)
  (unless extension (setq extension "md"))
  (find-file
   (scratchpad-make-full-path folder title extension))
  (insert
   (concat "# " title (format-time-string "\n(%c %Z)\n\n"))))

(defun make-sh-template (folder title &amp;optional extension)
  (unless extension (setq extension "sh"))
  (find-file
   (scratchpad-make-full-path folder title extension))
  (insert
   (concat "#!/bin/sh\n# " title (format-time-string "(%c %Z)\n\n"))))

(defun make-org-template (folder title &amp;optional extension)
  (unless extension (setq extension "org"))
  (find-file
   (scratchpad-make-full-path folder title extension))
  (insert
   (concat "#+TITLE: " title (format-time-string "\n#+DATE: %c %Z\n\n"))))

(global-set-key (kbd "H-h H-s") 'iz-scratchpad-menu)

(add-hook 'after-save-hook
          #'(lambda ()
              (and (save-excursion
                     (save-restriction
                       (widen)
                       (goto-char (point-min))
                       (save-match-data
                         (looking-at "^#!"))))
                   (not (file-executable-p buffer-file-name))
                   (shell-command (concat "chmod u+x " buffer-file-name))
                   (message
                    (concat "Saved as script: " buffer-file-name)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> SuperCollider</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> sclang Setup</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;;; Directory of SuperCollider support, for quarks, plugins, help etc.
(defvar sc_userAppSupportDir
  (expand-file-name "~/Library/Application Support/SuperCollider"))

;; Make path of sclang executable available to emacs shell load path
(add-to-list
 'exec-path
 "/Applications/SuperCollider/SuperCollider.app/Contents/Resources/")

;; Global keyboard shortcut for starting sclang
(global-set-key (kbd "C-c M-s") 'sclang-start)
;; overrides alt-meta switch command
(global-set-key (kbd "C-c W") 'sclang-switch-to-workspace)

;; Disable switching to default SuperCollider Workspace when recompiling SClang
(setq sclang-show-workspace-on-startup nil)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'sclang)
</pre>
</div>
</div>
</div>
