user/iani.org
*** SuperCollider-specific minor modes
:PROPERTIES:
:ID:       9AA46A54-CA59-41EF-8514-77420657A4CF
:eval-id:  2
:END:

Needs debugging: One of these modes breaks sclang-start:

#+BEGIN_SRC emacs-lisp
  ;; Note: Paredit-style bracket movement commands d, u, f, b, n, p work
  ;; in sclang-mode without loading Paredit.
  ;; (add-hook 'sclang-mode-hook 'paredit-mode)
  (add-hook 'sclang-mode-hook 'rainbow-delimiters-mode)
  (add-hook 'sclang-mode-hook 'hl-sexp-mode)
  (add-hook 'sclang-mode-hook 'electric-pair-mode)
  (add-hook 'sclang-mode-hook 'yas-minor-mode)
  (add-hook 'sclang-mode-hook 'auto-complete-mode)
  ;; sclang-ac-mode is included in sclang-extensions-mode:
  ;; (add-hook 'sclang-mode-hook 'sclang-ac-mode)
  ;; sclang-ac mode constantly tries to run code.
  ;; that can lead to loops that hang, for example constantly creating a view.
  ;; (add-hook 'sclang-mode-hook 'sclang-extensions-mode)
#+END_SRC

*** sclang keyboard shortcuts

#+BEGIN_SRC emacs-lisp
;; Global keyboard shortcut for starting sclang
(global-set-key (kbd "C-c M-s") 'sclang-start)
;; Show workspace
(global-set-key (kbd "C-c C-M-w") 'sclang-switch-to-workspace)
#+END_SRC
** Emacs Lisp
:PROPERTIES:
:ID:       63CDCCDC-EE4D-4C1E-8C72-4B605B330969
:END:
#+BEGIN_SRC emacs-lisp
  (add-hook 'emacs-lisp-mode-hook 'hl-sexp-mode)
  (add-hook 'emacs-lisp-mode-hook 'hs-minor-mode)
  (global-set-key (kbd "H-l h") 'hs-hide-level)
  (global-set-key (kbd "H-l s") 'hs-show-all)

  (add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode)
  (require 'paredit) ;; smart edit parentheses
  (require 'cl)
  (require 'litable) ;; show lisp eval results in the buffer, interactively
  (add-hook 'emacs-lisp-mode-hook 'paredit-mode)
  (add-hook 'emacs-lisp-mode-hook 'turn-on-whitespace-mode)
  (add-hook 'emacs-lisp-mode-hook 'auto-complete-mode)
  (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
  ;; H-C-i:
  (define-key emacs-lisp-mode-map (kbd "H-TAB") 'icicle-imenu-command)
#+END_SRC
** html/css/js
CLOCK: [2015-01-16 Fri 13:34]--[2015-01-16 Fri 13:34] =>  0:00
:PROPERTIES:
:ID:       D3EC60BA-8854-4752-9A9B-7DF7322D0589
:END:

web-beautify.
HTML, CSS, and JavaScript/JSON formatting
https://github.com/yasuyk/web-beautify

Shell command, install js-beautify library:web
: npm -g install js-beautify
Emacs sexp, install emacs web-beautify package:
: (package-install 'web-beautify)

** org-mode
*** binding for org show subtree

#+BEGIN_SRC emacs-lisp
(eval-after-load 'org
    '(define-key org-mode-map (kbd "C-c C-x s") 'org-show-subtree))
#+END_SRC

*** Using ido for org-goto

#+BEGIN_SRC emacs-lisp
  (setq org-goto-interface 'outline-path-completion
        org-goto-max-level 10)
#+END_SRC

*** Working with icicles/ido-menu/lacarte in org-mode and elsewhere
**** lacarte/icicle-menu shortcut: H-C-i,
#+BEGIN_SRC emacs-lisp
  ;; Previously bound only to org-mode map.
  (global-set-key (kbd "H-TAB") 'icicle-imenu)
  (global-set-key (kbd "H-C-l") 'lacarte-execute-menu-command)
#+END_SRC
