user/iani.html

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><a id="ID-9AA46A54-CA59-41EF-8514-77420657A4CF" name="ID-9AA46A54-CA59-41EF-8514-77420657A4CF"></a><span class="section-number-4">2.2.2</span> SuperCollider-specific minor modes</h4>
<div class="outline-text-4" id="text-2-2-2">

<p>
Needs debugging: One of these modes breaks sclang-start:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;; Note: Paredit-style bracket movement commands d, u, f, b, n, p work
;; in sclang-mode without loading Paredit.
;; (add-hook 'sclang-mode-hook 'paredit-mode)
(add-hook 'sclang-mode-hook 'rainbow-delimiters-mode)
(add-hook 'sclang-mode-hook 'hl-sexp-mode)
(add-hook 'sclang-mode-hook 'electric-pair-mode)
(add-hook 'sclang-mode-hook 'yas-minor-mode)
(add-hook 'sclang-mode-hook 'auto-complete-mode)
;; sclang-ac-mode is included in sclang-extensions-mode:
;; (add-hook 'sclang-mode-hook 'sclang-ac-mode)
;; sclang-ac mode constantly tries to run code.
;; that can lead to loops that hang, for example constantly creating a view.
;; (add-hook 'sclang-mode-hook 'sclang-extensions-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> sclang keyboard shortcuts</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; Global keyboard shortcut for starting sclang
(global-set-key (kbd "C-c M-s") 'sclang-start)
;; Show workspace
(global-set-key (kbd "C-c C-M-w") 'sclang-switch-to-workspace)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><a id="ID-63CDCCDC-EE4D-4C1E-8C72-4B605B330969" name="ID-63CDCCDC-EE4D-4C1E-8C72-4B605B330969"></a><span class="section-number-3">2.3</span> Emacs Lisp</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'emacs-lisp-mode-hook 'hl-sexp-mode)
(add-hook 'emacs-lisp-mode-hook 'hs-minor-mode)
(global-set-key (kbd "H-l h") 'hs-hide-level)
(global-set-key (kbd "H-l s") 'hs-show-all)

(add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode)
(require 'paredit) ;; smart edit parentheses
(require 'cl)
(require 'litable) ;; show lisp eval results in the buffer, interactively
(add-hook 'emacs-lisp-mode-hook 'paredit-mode)
(add-hook 'emacs-lisp-mode-hook 'turn-on-whitespace-mode)
(add-hook 'emacs-lisp-mode-hook 'auto-complete-mode)
(add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
;; H-C-i:
(define-key emacs-lisp-mode-map (kbd "H-TAB") 'icicle-imenu-command)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><a id="ID-D3EC60BA-8854-4752-9A9B-7DF7322D0589" name="ID-D3EC60BA-8854-4752-9A9B-7DF7322D0589"></a><span class="section-number-3">2.4</span> html/css/js</h3>
<div class="outline-text-3" id="text-2-4">

<p>
web-beautify.
HTML, CSS, and JavaScript/JSON formatting
<a href="https://github.com/yasuyk/web-beautify">https://github.com/yasuyk/web-beautify</a>
</p>

<p>
Shell command, install js-beautify library:web
</p>
<pre class="example">
npm -g install js-beautify
</pre>
<p>
Emacs sexp, install emacs web-beautify package:
</p>
<pre class="example">
(package-install 'web-beautify)
</pre>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> org-mode</h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> binding for org show subtree</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-load 'org
    '(define-key org-mode-map (kbd "C-c C-x s") 'org-show-subtree))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> Using ido for org-goto</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-goto-interface 'outline-path-completion
      org-goto-max-level 10)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5-3" class="outline-4">
<h4 id="sec-2-5-3"><span class="section-number-4">2.5.3</span> Working with icicles/ido-menu/lacarte in org-mode and elsewhere</h4>
<div class="outline-text-4" id="text-2-5-3">
</div><ol class="org-ol"><li><a id="sec-2-5-3-1" name="sec-2-5-3-1"></a>lacarte/icicle-menu shortcut: H-C-i,<br  /><div class="outline-text-5" id="text-2-5-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; Previously bound only to org-mode map.
(global-set-key (kbd "H-TAB") 'icicle-imenu)
(global-set-key (kbd "H-C-l") 'lacarte-execute-menu-command)
</pre>
</div>
</div>
</li>
