user/iani.org
**** making icicle-imenu and icicle-occur work with org-mode
:PROPERTIES:
:ID:       0C9AB822-9FE5-4F1B-9925-046170CA4828
:eval-id:  3
:END:
Following needs review! Fri, Nov 28 2014, 10:44 EET
#+BEGIN_SRC emacs-lisp
  (defun org-icicle-occur ()
    "In org-mode, show entire buffer contents before running icicle-occur.
   Otherwise icicle-occur will not place cursor at found location,
   if the location is hidden."
    (interactive)
    (show-all)
    (icicle-occur (point-min) (point-max))
    (recenter 3))

  (eval-after-load 'org
    '(define-key org-mode-map (kbd "C-c '") 'org-edit-special))
  (eval-after-load 'org
    '(define-key org-mode-map (kbd "H-i") 'org-icicle-occur))
  (defun org-icicle-imenu (separate-buffer)
    "In org-mode, show entire buffer contents before running icicle-imenu.
  Otherwise icicle-occur will not place cursor at found location,
  if the location is hidden.
  If called with prefix argument (C-u), then:
  - open the found section in an indirect buffer.
  - go back to the position where the point was before the command, in the
    original buffer."
    (interactive "P")
    (icicle-mode 1)
    (show-all)
    (let ((mark (point)))
      (icicle-imenu (point-min) (point-max) t)
      (cond (separate-buffer
             (org-tree-to-indirect-buffer)
             (goto-char mark))
            (t (recenter 4))))
    (icicle-mode -1))

  (eval-after-load 'org
    '(define-key org-mode-map (kbd "C-c C-=") 'org-icicle-imenu))
  (eval-after-load 'org
    '(define-key org-mode-map (kbd "C-c i m") 'org-icicle-imenu))

  ;; install alternative for org-mode C-c = org-table-eval-formula
  ;; which is stubbornly overwritten by icy-mode.
  (eval-after-load 'org
    '(define-key org-mode-map (kbd "C-c C-x =") 'org-table-eval-formula))

  ;; Both eval-after-load and org-mode hook do not work for switching off
  ;; prelude mode, whitespace.  So using shortcuts as workaround:

  (defun turn-off-whitespace-mode ()
    (interactive)
    (whitespace-mode -1))

  (defun turn-off-icicle-mode ()
    (interactive)
    (icicle-mode -1))

  (defun turn-off-prelude-mode ()
    (interactive)
    (prelude-mode -1))

  (global-set-key (kbd "H-x w") 'turn-off-whitespace-mode)
  (global-set-key (kbd "H-x p") 'turn-off-prelude-mode)
  (global-set-key (kbd "H-x i") 'turn-off-icicle-mode)

  (add-hook 'org-mode-hook
            (lambda ()
              (local-set-key (kbd "C-c M-=") 'org-table-eval-formula)
              (local-set-key (kbd "C-c '") 'org-edit-special)))

  ;;; ???? Adapt org-mode to icicle menus when refiling (C-c C-w)
  ;;; Still problems. Cannot use standard org refiling with icicles activated!
  (setq org-outline-path-complete-in-steps nil)
#+END_SRC

**** Definitely switch prelude off in org mode, as it totally screws-up key bindings

Especially in the case of Meta-shift-up and Meta-shift-down for spreadsheets.
Have not figured out yet how to override those keys specifically.

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook
            (lambda ()
              (prelude-mode -1)))
  (add-hook 'org-mode-hook 'prelude-off)
#+END_SRC


**** Providing alternatives for refile and copy using icicles

#+BEGIN_SRC emacs-lisp
  (defun org-refile-icy (as-subtree &optional do-copy-p)
    "Alternative to org-refile using icicles.
  Refile or copy current section, to a location in the file selected with icicles.
  Without prefix argument: Place the copied/cut section it *after* the selected section.
  With prefix argument: Make the copied/cut section *a subtree* of the selected section.

  Note 1: If quit with C-g, this function will have removed the section that
  is to be refiled.  To get it back, one has to undo, or paste.

  Note 2: Reason for this function is that icicles seems to break org-modes headline
  buffer display, so onehas to use icicles for all headline navigation if it is loaded."
    (interactive "P")
    (outline-back-to-heading)
    (if do-copy-p (org-copy-subtree) (org-cut-subtree))
    (show-all)
    (icicle-imenu (point-min) (point-max) t)
    (outline-next-heading)
    (unless (eq (current-column) 0) (insert "\n"))
    (org-paste-subtree)
    (if as-subtree (org-demote-subtree)))

  (defun org-copy-icy (as-subtree)
    "Copy section to another location in file, selecting the location with icicles.
  See org-refile-icy."
    (interactive "P")
    (org-refile-icy as-subtree t))

  (eval-after-load 'org
    '(define-key org-mode-map (kbd "C-c i r") 'org-refile-icy))
  (eval-after-load 'org
    '(define-key org-mode-map (kbd "C-c i c") 'org-copy-icy))
#+END_SRC

*** Use visual line, whitespace and windmove in org-mode

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook 'visual-line-mode)
  (add-hook 'org-mode-hook 'turn-off-whitespace-mode)
  (add-hook 'org-shiftup-final-hook 'windmove-up)
  (add-hook 'org-shiftleft-final-hook 'windmove-left)
  (add-hook 'org-shiftdown-final-hook 'windmove-down)
  (add-hook 'org-shiftright-final-hook 'windmove-right)
#+END_SRC

