user/iani.org
*** Customize Org-mode display, including todo colors
:PROPERTIES:
:ID:       4EDF3266-E3AB-42DD-BCAC-F6166C3681DB
:eval-id:  8
:END:

Adapted from:


#+BEGIN_SRC emacs-lisp
  (setq org-startup-indented t) ;; auto-indent text in subtrees
  (setq org-hide-leading-stars t) ;; hide leading stars in subtree headings
  (setq org-src-fontify-natively t) ;; colorize source-code blocks natively
  (setq org-todo-keywords
        '((sequence
           "!!!(1)"  ; next action
           "!!(2)"  ; next action
           "!(3)"  ; next action
           "TODO(t)"  ; next action
           "STARTED(s)"
           "TOCHECK(C)"
           "WAITING(w@/!)"
           "TOBLOG(b)"  ; next action
           "SOMEDAY(.)" "|"
           "DONE(x@/@)"
           "CANCELLED(c@)"
           "OBSOLETE(o@)")
          (sequence
           "TODELEGATE(-)"
           "DELEGATED(d)"
           "DELEGATE_DONE(l!)")))

  (setq org-todo-keyword-faces
        '(("!!!" . (:foreground "red" :weight bold))
          ("!!" . (:foreground "tomato" :weight bold))
          ("!" . (:foreground "coral" :weight bold))
          ("TODO" . (:foreground "LightSalmon" :weight bold))
          ("TOBLOG" . (:foreground "MediumVioletRed" :weight bold))
          ("STARTED" . (:foreground "DeepPink" :weight bold))
          ("TOCHECK" . (:foreground "IndianRed2" :weight bold))
          ("WAITING" . (:foreground "gold" :weight bold))
          ("DONE" . (:foreground "SeaGreen" :weight bold))
          ("CANCELLED" . (:foreground "wheat" :weight bold))
          ("OBSOLETE" . (:foreground "CadetBlue" :weight bold))
          ("TODELEGATE" . (:foreground "DeepSkyBlue" :weight bold))
          ("DELEGATED" . (:foreground "turquoise" :weight bold))
          ("DELEGATE_DONE" . (:foreground "LawnGreen" :weight bold))
          ("WAITING" . (:foreground "goldenrod" :weight bold))
          ("SOMEDAY" . (:foreground "gray" :weight bold))))
#+END_SRC

*** Mobile Org

#+BEGIN_SRC emacs-lisp
  ;; the rest of the setup was done by customizing the variables
  ;; org-mobile-directory and org-mobile-inbox-for-pull, and is in custom.el

  (global-set-key (kbd "H-h m p") 'org-mobile-push)
  (global-set-key (kbd "H-h m l") 'org-mobile-pull)

#+END_SRC

Following was tested, works OK, but is disabled for the moment:

http://kenmankoff.com/2012/08/17/emacs-org-mode-and-mobileorg-auto-sync/

#+BEGIN_SRC elisp
(defun install-monitor (file secs)
  (run-with-timer
   0 secs
   (lambda (f p)
     (unless (< p (second (time-since (elt (file-attributes f) 5))))
       (org-mobile-pull)))
   file secs))

(defvar monitor-timer
  (install-monitor (concat org-mobile-directory "/mobileorg.org") 30)
  "Check if file changed every 30 s.")

#+END_SRC
*** line->headline

#+BEGIN_SRC emacs-lisp
  (defun org-headline-line ()
    "convert current line into headline at same level as above."
    (interactive)
    (beginning-of-line)
    (org-meta-return)
    ;; (delete-char 1)
    )

  (eval-after-load 'org
    '(progn
       (define-key org-mode-map (kbd "C-M-<return>") 'org-headline-line)))
#+END_SRC

*** Agenda
**** Global key for org-agenda: C-c a
#+BEGIN_SRC emacs-lisp
  (global-set-key "\C-ca" 'org-agenda)
#+END_SRC
