user/iani.html

<div id="outline-container-sec-2-5-5" class="outline-4">
<h4 id="sec-2-5-5"><a id="ID-4EDF3266-E3AB-42DD-BCAC-F6166C3681DB" name="ID-4EDF3266-E3AB-42DD-BCAC-F6166C3681DB"></a><span class="section-number-4">2.5.5</span> Customize Org-mode display, including todo colors</h4>
<div class="outline-text-4" id="text-2-5-5">

<p>
Adapted from:
</p>


<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-startup-indented t) ;; auto-indent text in subtrees
(setq org-hide-leading-stars t) ;; hide leading stars in subtree headings
(setq org-src-fontify-natively t) ;; colorize source-code blocks natively
(setq org-todo-keywords
      '((sequence
         "!!!(1)"  ; next action
         "!!(2)"  ; next action
         "!(3)"  ; next action
         "TODO(t)"  ; next action
         "STARTED(s)"
         "WAITING(w@/!)"
         "TOBLOG(b)"  ; next action
         "SOMEDAY(.)" "|"
         "DONE(x@/@)"
         "CANCELLED(c@)"
         "OBSOLETE(o@)")
        (sequence
         "TODELEGATE(-)"
         "DELEGATED(d)"
         "DELEGATE_DONE(l!)")))

(setq org-todo-keyword-faces
      '(("!!!" . (:foreground "red" :weight bold))
        ("!!" . (:foreground "tomato" :weight bold))
        ("!" . (:foreground "coral" :weight bold))
        ("TODO" . (:foreground "LightSalmon" :weight bold))
        ("TOBLOG" . (:foreground "MediumVioletRed" :weight bold))
        ("STARTED" . (:foreground "DeepPink" :weight bold))
        ("WAITING" . (:foreground "gold" :weight bold))
        ("DONE" . (:foreground "SeaGreen" :weight bold))
        ("CANCELLED" . (:foreground "wheat" :weight bold))
        ("OBSOLETE" . (:foreground "CadetBlue" :weight bold))
        ("TODELEGATE" . (:foreground "DeepSkyBlue" :weight bold))
        ("DELEGATED" . (:foreground "turquoise" :weight bold))
        ("DELEGATE_DONE" . (:foreground "LawnGreen" :weight bold))
        ("WAITING" . (:foreground "goldenrod" :weight bold))
        ("SOMEDAY" . (:foreground "gray" :weight bold))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5-6" class="outline-4">
<h4 id="sec-2-5-6"><span class="section-number-4">2.5.6</span> Mobile Org</h4>
<div class="outline-text-4" id="text-2-5-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; the rest of the setup was done by customizing the variables
;; org-mobile-directory and org-mobile-inbox-for-pull, and is in custom.el

(global-set-key (kbd "H-h m p") 'org-mobile-push)
(global-set-key (kbd "H-h m l") 'org-mobile-pull)
</pre>
</div>

<p>
Following was tested, works OK, but is disabled for the moment:
</p>

<p>
<a href="http://kenmankoff.com/2012/08/17/emacs-org-mode-and-mobileorg-auto-sync/">http://kenmankoff.com/2012/08/17/emacs-org-mode-and-mobileorg-auto-sync/</a>
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun install-monitor (file secs)
  (run-with-timer
   0 secs
   (lambda (f p)
     (unless (&lt; p (second (time-since (elt (file-attributes f) 5))))
       (org-mobile-pull)))
   file secs))

(defvar monitor-timer
  (install-monitor (concat org-mobile-directory "/mobileorg.org") 30)
  "Check if file changed every 30 s.")
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-5-7" class="outline-4">
<h4 id="sec-2-5-7"><span class="section-number-4">2.5.7</span> line-&gt;headline</h4>
<div class="outline-text-4" id="text-2-5-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-headline-line ()
  "convert current line into headline at same level as above."
  (interactive)
  (beginning-of-line)
  (org-meta-return)
  (delete-char 1))

(eval-after-load 'org
  '(progn
     (define-key org-mode-map (kbd "C-M-&lt;return&gt;") 'org-headline-line)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5-8" class="outline-4">
<h4 id="sec-2-5-8"><span class="section-number-4">2.5.8</span> Agenda</h4>
<div class="outline-text-4" id="text-2-5-8">
</div><ol class="org-ol"><li><a id="sec-2-5-8-1" name="sec-2-5-8-1"></a>Global key for org-agenda: C-c a<br  /><div class="outline-text-5" id="text-2-5-8-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key "\C-ca" 'org-agenda)
</pre>
</div>
</div>
</li>
