user/iani.org
**** Add, remove, save agenda file list

#+BEGIN_SRC emacs-lisp
  (defvar org-agenda-list-save-path
    "~/.emacs.d/savefile/org-agenda-list.el"
  "Path to save the list of files belonging to the agenda.")

  (defun org-agenda-save-file-list ()
    "Save list of desktops from file in org-agenda-list-save-path"
    (interactive)
    (save-excursion
      (let ((buf (find-file-noselect org-agenda-list-save-path)))
        (set-buffer buf)
        (erase-buffer)
        (print (list 'quote org-agenda-files) buf)
        (save-buffer)
        (kill-buffer)
        (message "org-agenda file list saved to: %s" org-agenda-list-save-path))))

  (defun org-agenda-load-file-list ()
    "Load list of desktops from file in org-agenda-list-save-path"
    (interactive)
    (save-excursion
      (let ((buf (find-file-noselect org-agenda-list-save-path)))
        (set-buffer buf)
        (setq org-agenda-files (eval (read (buffer-string))))
        (kill-buffer)
        (message "org-agenda file list loaded from: %s" org-agenda-list-save-path))))

  (defun org-agenda-add-this-file-to-agenda ()
    "Add the file from the current buffer to org-agenda-files list."
    (interactive)
    (let (path)
      ;; (org-agenda-file-to-front) ;; adds path relative to user home dir
      ;; (message "Added current buffer to agenda files.")
      (let ((path (buffer-file-name (current-buffer))))
        (cond (path
          (add-to-list 'org-agenda-files path)
          (org-agenda-save-file-list)
          (message "Added file '%s' to agenda file list"
                   (file-name-base path)))
              (t (message "Cannot add buffer to file list. Save buffer first."))))))

  (defun org-agenda-remove-this-file-from-agenda (&optional select-from-list)
    "Remove a file from org-agenda-files list.
  If called without prefix argument, remove the file of the current buffer.
  If called with prefix argument, then select a file from org-agenda-files list."
    (interactive "P")
    (let (path)
     (if select-from-list
         (let  ((menu (grizzl-make-index org-agenda-files)))
           (setq path (grizzl-completing-read "Choose an agenda file: " menu)))
       (setq path (buffer-file-name (current-buffer))))
     (setq org-agenda-files
           (remove (buffer-file-name (current-buffer)) org-agenda-files)))
    (org-agenda-save-file-list)
    (message "Removed file '%s' from agenda file list"
             (file-name-base (buffer-file-name (current-buffer)))))

  (defun org-agenda-open-file ()
    "Open a file from the current agenda file list."
    (interactive)
    (let* ((menu (grizzl-make-index org-agenda-files))
          (answer (grizzl-completing-read "Choose an agenda file: " menu)))
      (find-file answer)))

  (defun org-agenda-list-files ()
    "List the paths that are currently in org-agenda-files"
    (interactive)
    (let  ((menu (grizzl-make-index org-agenda-files)))
      (grizzl-completing-read "These are currently the files in list org-agenda-files. " menu)))

  (defun org-agenda-list-menu ()
   "Present menu with commands for loading, saving, adding and removing
  files to org-agenda-files."
   (interactive)
   (let* ((menu (grizzl-make-index
                 '("org-agenda-save-file-list"
                   "org-agenda-load-file-list"
                   "org-agenda-list-files"
                   "org-agenda-open-file"
                   "org-agenda-add-this-file-to-agenda"
                   "org-agenda-remove-this-file-from-agenda")))
          (command (grizzl-completing-read "Choose a command: " menu)))
     (call-interactively (intern command))))

  (global-set-key (kbd "H-a H-a") 'org-agenda-list-menu)

#+END_SRC


**** Calendar framework: Show org agenda in iCal-style layout

#+BEGIN_SRC emacs-lisp
 (require 'calfw-org)
#+END_SRC

***** Global key for cfw org calendar framework): C-c M-a

#+BEGIN_SRC emacs-lisp
  (global-set-key "\C-c\M-a" 'cfw:open-org-calendar)
  (global-set-key "\C-c\C-xm" 'org-mark-ring-goto)
#+END_SRC

***** Open cfw in 2-week mode

#+BEGIN_SRC emacs-lisp
  (defun cfw:open-org-calendar-two-week ()
    "Open an org schedule calendar in the new buffer."
    (interactive)
    (let* ((source1 (cfw:org-create-source))
           (cp (cfw:create-calendar-component-buffer
                :view 'two-weeks
                :contents-sources (list source1)
                :custom-map cfw:org-schedule-map
                :sorter 'cfw:org-schedule-sorter)))
      (switch-to-buffer (cfw:cp-get-buffer cp))))
#+END_SRC

