user/iani.html

<li><a id="sec-2-5-8-5" name="sec-2-5-8-5"></a>Insert DATE property<br  /><div class="outline-text-5" id="text-2-5-8-5">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-set-date (&amp;optional active property)
  "Set DATE property with current time.  Active timestamp."
  (interactive "P")
  (org-set-property
   (if property property "DATE")
   (cond ((equal active nil)
          (format-time-string (cdr org-time-stamp-formats) (current-time)))
         ((equal active '(4))
          (concat "["
                  (substring
                   (format-time-string (cdr org-time-stamp-formats) (current-time))
                   1 -1)
                  "]"))
         ((equal active '(16))
          (concat
           "["
           (substring
            (format-time-string (cdr org-time-stamp-formats) (org-read-date t t))
            1 -1)
           "]"))
         ((equal active '(64))
          (format-time-string (cdr org-time-stamp-formats) (org-read-date t t))))))

;; Note: This keybinding is in analogy to the standard keybinding:
;; C-c . -&gt; org-time-stamp
(eval-after-load 'org
  '(progn
     (define-key org-mode-map (kbd "C-c C-.") 'org-set-date)
     ;; Prelude defines C-c d as duplicate line
     ;; But we disable prelude in org-mode because of other, more serious conflicts,
     ;; So we keep this alternative key binding:
     (define-key org-mode-map (kbd "C-c d") 'org-set-date)))
</pre>
</div>
</div>
</li>

<li><a id="sec-2-5-8-6" name="sec-2-5-8-6"></a>Set DUE property with selected time/date<br  /><div class="outline-text-5" id="text-2-5-8-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-set-due-property ()
  (interactive)
  (org-set-property
   "DUE"
   (format-time-string (cdr org-time-stamp-formats) (org-read-date t t))))

(eval-after-load 'org
  '(define-key org-mode-map (kbd "C-c M-.") 'org-set-due-property))
</pre>
</div>
</div>
</li></ol>
</div>
