user/iani.org
*** Org-Babel
**** Org-Babel: enable some languages

Enable some cool languages in org-babel mode.

#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (sh . t)
   (ruby . t)
   (python . t)
   (perl . t)
   ))
#+END_SRC
**** Org-Babel: load current file

#+BEGIN_SRC emacs-lisp
  (defun org-babel-load-current-file ()
    (interactive)
    (org-babel-load-file (buffer-file-name (current-buffer))))

  ;; Note: Overriding default key binding to provide consistent pattern:
  ;; C-c C-v f -> tangle, C-c C-v C-f -> load
  (eval-after-load 'org
    '(define-key org-mode-map (kbd "C-c C-v C-f") 'org-babel-load-current-file))
#+END_SRC

#+RESULTS:
: org-babel-load-current-file
**** emacs-lisp block (de-)activation

#+BEGIN_SRC emacs-lisp
  (defun org-find-next-elisp-block ()
    (interactive)
    (re-search-forward "^#\\+BEGIN_SRC \\(emacs-lisp\\|elisp\\)" nil t)
    (when (match-string 0)
      (org-reveal)
      (recenter-top-bottom 3)))

  (defun org-toggle-elisp-block ()
    (interactive)
    (save-excursion
      (let* ((plist (cadr (org-element-at-point)))
            (language (plist-get plist :language))
            (begin (plist-get plist :begin)))
        (goto-char begin)
        (cond
         ((equal language "emacs-lisp")
          (re-search-forward "emacs-lisp")
          (replace-match "elisp"))
         ((equal language "elisp")
          (re-search-forward "elisp")
          (replace-match "emacs-lisp"))))))

  (global-set-key (kbd "H-b e") 'org-find-next-elisp-block)
  (global-set-key (kbd "<f5>") 'org-find-next-elisp-block)
  (global-set-key (kbd "H-b t") 'org-toggle-elisp-block)
  (global-set-key (kbd "<f6>") 'org-toggle-elisp-block)
#+END_SRC

#+RESULTS:
: org-toggle-elisp-block

*** Orgmode latex customization

Note Mon, Dec 15 2014, 16:29 EET: XeLaTeX covers most needs that I have for western european languages, Greek and Japanese.

#+BEGIN_SRC emacs-lisp
  ;;; Load latex package
  (require 'ox-latex)

  ;;; Use xelatex instead of pdflatex, for support of multilingual fonts (Greek etc.)
  ;; Note: Use package polyglossia to customize dates and other details.
  (setq org-latex-pdf-process
        (list "xelatex -interaction nonstopmode -output-directory %o %f"
              "xelatex -interaction nonstopmode -output-directory %o %f"
              "xelatex -interaction nonstopmode -output-directory %o %f"))

  ;; This is kept as reference. XeLaTeX covers all european/greek/asian needs.
  ;; It is the original setting for working with pdflatex:
  ;; (setq org-latex-pdf-process
  ;;  ("pdflatex -interaction nonstopmode -output-directory %o %f"
  ;;   "pdflatex -interaction nonstopmode -output-directory %o %f"
  ;;   "pdflatex -interaction nonstopmode -output-directory %o %f"))

  ;;; Add beamer to available latex classes, for slide-presentaton format
  (add-to-list 'org-latex-classes
               '("beamer"
                 "\\documentclass\[presentation\]\{beamer\}"
                 ("\\section\{%s\}" . "\\section*\{%s\}")
                 ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
                 ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))

  ;;; Add memoir class (experimental)
  (add-to-list 'org-latex-classes
               '("memoir"
                 "\\documentclass[12pt,a4paper,article]{memoir}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  ;; Reconfigure memoir to make a book (or report) from a org subtree
  (add-to-list 'org-latex-classes
               '("section-to-book"
                 "\\documentclass{memoir}"
                 ("\\chapter{%s}" . "\\chapter*{%s}") ;; actually: BOOK TITLE!
                 ("\\section{%s}" . "\\section*{%s}") ;; actually: Chapter!
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")))

  ;; Letter
  (add-to-list 'org-latex-classes
               '("letter"
                 "\\documentclass{letter}"
                 ;; Should not use subsections at all!:
                 ("\\chapter{%s}" . "\\chapter*{%s}")
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")))

  (add-to-list 'org-latex-classes
               '("newlfm-letter"
                 "\\documentclass[11pt,letter,dateno,sigleft]{newlfm}"
                 ;; Should not use subsections at all!:
                 ("\\chapter{%s}" . "\\chapter*{%s}")
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")))
#+END_SRC

**** export subtree as latex with header selected from file template
:PROPERTIES:
:DATE:     <2014-12-15 Mon 20:25>
:END:

Todo:

***** TODO Define command for switching between xelatex/pdflatex
:PROPERTIES:
:DATE:     <2014-12-15 Mon 15:21>
:END:

