user/iani.html

<div id="outline-container-sec-2-5-10" class="outline-4">
<h4 id="sec-2-5-10"><span class="section-number-4">2.5.10</span> Org-Babel</h4>
<div class="outline-text-4" id="text-2-5-10">
</div><ol class="org-ol"><li><a id="sec-2-5-10-1" name="sec-2-5-10-1"></a>Org-Babel: enable some languages<br  /><div class="outline-text-5" id="text-2-5-10-1">
<p>
Enable some cool languages in org-babel mode.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (sh . t)
   (ruby . t)
   (python . t)
   (perl . t)
   ))
</pre>
</div>
</div>
</li>
<li><a id="sec-2-5-10-2" name="sec-2-5-10-2"></a>Org-Babel: load current file<br  /><div class="outline-text-5" id="text-2-5-10-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-babel-load-current-file ()
  (interactive)
  (org-babel-load-file (buffer-file-name (current-buffer))))

;; Note: Overriding default key binding to provide consistent pattern:
;; C-c C-v f -&gt; tangle, C-c C-v C-f -&gt; load
(eval-after-load 'org
  '(define-key org-mode-map (kbd "C-c C-v C-f") 'org-babel-load-current-file))
</pre>
</div>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-5-11" class="outline-4">
<h4 id="sec-2-5-11"><span class="section-number-4">2.5.11</span> Orgmode latex customization</h4>
<div class="outline-text-4" id="text-2-5-11">
<p>
Note Mon, Dec 15 2014, 16:29 EET: XeLaTeX covers most needs that I have for western european languages, Greek and Japanese.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">;;; Load latex package
(require 'ox-latex)

;;; Use xelatex instead of pdflatex, for support of multilingual fonts (Greek etc.)
;; Note: Use package polyglossia to customize dates and other details.
(setq org-latex-pdf-process
      (list "xelatex -interaction nonstopmode -output-directory %o %f"
            "xelatex -interaction nonstopmode -output-directory %o %f"
            "xelatex -interaction nonstopmode -output-directory %o %f"))

;; This is kept as reference. XeLaTeX covers all european/greek/asian needs.
;; It is the original setting for working with pdflatex:
;; (setq org-latex-pdf-process
;;  ("pdflatex -interaction nonstopmode -output-directory %o %f"
;;   "pdflatex -interaction nonstopmode -output-directory %o %f"
;;   "pdflatex -interaction nonstopmode -output-directory %o %f"))

;;; Add beamer to available latex classes, for slide-presentaton format
(add-to-list 'org-latex-classes
             '("beamer"
               "\\documentclass\[presentation\]\{beamer\}"
               ("\\section\{%s\}" . "\\section*\{%s\}")
               ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
               ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))

;;; Add memoir class (experimental)
(add-to-list 'org-latex-classes
             '("memoir"
               "\\documentclass[12pt,a4paper,article]{memoir}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

;; Reconfigure memoir to make a book (or report) from a org subtree
(add-to-list 'org-latex-classes
             '("section-to-book"
               "\\documentclass{memoir}"
               ("\\chapter{%s}" . "\\chapter*{%s}") ;; actually: BOOK TITLE!
               ("\\section{%s}" . "\\section*{%s}") ;; actually: Chapter!
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")))

;; Letter
(add-to-list 'org-latex-classes
             '("letter"
               "\\documentclass{letter}"
               ;; Should not use subsections at all!:
               ("\\chapter{%s}" . "\\chapter*{%s}")
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")))

(add-to-list 'org-latex-classes
             '("newlfm-letter"
               "\\documentclass[11pt,letter,dateno,sigleft]{newlfm}"
               ;; Should not use subsections at all!:
               ("\\chapter{%s}" . "\\chapter*{%s}")
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")))
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="sec-2-5-11-1" name="sec-2-5-11-1"></a>export subtree as latex with header selected from file template<br  /><div class="outline-text-5" id="text-2-5-11-1">

<p>
Todo:
</p>
</div>

<ol class="org-ol"><li><a id="sec-2-5-11-1-1" name="sec-2-5-11-1-1"></a><span class="todo TODO">TODO</span> Define command for switching between xelatex/pdflatex<br  /><div class="outline-text-6" id="text-2-5-11-1-1">
</div>
</li>
