user/iani.html


<div id="outline-container-sec-2-5-12" class="outline-4">
<h4 id="sec-2-5-12"><span class="section-number-4">2.5.12</span> Org-crypt: Encrypt selected org-mode entries</h4>
<div class="outline-text-4" id="text-2-5-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance (quote ("crypt")))
;; GPG key to use for encryption
;; Either the Key ID or set to nil to use symmetric encryption.
(setq org-crypt-key nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5-13" class="outline-4">
<h4 id="sec-2-5-13"><span class="section-number-4">2.5.13</span> org-reveal, ox-impress: Export slides for Reveal.js and impress.js from orgmode</h4>
<div class="outline-text-4" id="text-2-5-13">
<p>
Load org-reveal to make slides with reveal.js
</p>

<p>
<a href="https://github.com/yjwen/org-reveal/">https://github.com/yjwen/org-reveal/</a>
<a href="https://github.com/kinjo/org-impress-js.el">https://github.com/kinjo/org-impress-js.el</a>
</p>

<div class="org-src-container">

<pre class="src src-elisp">(require 'ox-reveal)
(require 'ox-impress-js)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5-14" class="outline-4">
<h4 id="sec-2-5-14"><span class="section-number-4">2.5.14</span> Folding and unfolding, selecting headings</h4>
<div class="outline-text-4" id="text-2-5-14">
</div><ol class="org-ol"><li><a id="sec-2-5-14-1" name="sec-2-5-14-1"></a>Extra shortcut: Widen<br  /><div class="outline-text-5" id="text-2-5-14-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-load 'org
  '(define-key org-mode-map (kbd "H-W") 'widen))
</pre>
</div>
</div>
</li>
<li><a id="sec-2-5-14-2" name="sec-2-5-14-2"></a>Macro: toggle drawer visibility for this node<br  /><div class="outline-text-5" id="text-2-5-14-2">

<p>
See: <a href="http://stackoverflow.com/questions/5500035/set-custom-keybinding-for-specific-emacs-mode">http://stackoverflow.com/questions/5500035/set-custom-keybinding-for-specific-emacs-mode</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(fset 'org-toggle-drawer
   (lambda (&amp;optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([67108896 3 16 14 tab 24 24] 0 "%d")) arg)))

(eval-after-load 'org
  '(define-key org-mode-map (kbd "C-c M-d") 'org-toggle-drawer))
</pre>
</div>
</div>
</li>

<li><a id="sec-2-5-14-3" name="sec-2-5-14-3"></a>Toggle folding of current item (Command and keyboard command)<br  /><div class="outline-text-5" id="text-2-5-14-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-cycle-current-entry ()
  "toggle visibility of current entry from within the entry."
  (interactive)
  (save-excursion)
  (outline-back-to-heading)
  (org-cycle))

(eval-after-load 'org
  '(define-key org-mode-map (kbd "C-c C-/") 'org-cycle-current-entry))
</pre>
</div>
</div>
</li>

<li><a id="sec-2-5-14-4" name="sec-2-5-14-4"></a>Keyboard Command Shortcut: Select heading of this node (for editing)<br  /><div class="outline-text-5" id="text-2-5-14-4">
<p>
Note: outline-previous-heading (C-c p) places the point at the beginning of the heading line.  To edit the heading, one has to go past the * that mark the heading.  org-select heading places the mark at the beginning of the heading text and selects the heading, so one can start editing the heading right away.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-select-heading ()
  "Go to heading of current node, select heading."
  (interactive)
  (outline-previous-heading)
  (search-forward (plist-get (cadr (org-element-at-point)) :raw-value))
  (set-mark (point))

  (beginning-of-line)
  (search-forward " "))

(eval-after-load 'org
  '(define-key org-mode-map (kbd "C-c C-h") 'org-select-heading))
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-2-5-15" class="outline-4">
<h4 id="sec-2-5-15"><span class="section-number-4">2.5.15</span> Encryption</h4>
<div class="outline-text-4" id="text-2-5-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance (quote ("crypt")))
;; GPG key to use for encryption
;; Either the Key ID or set to nil to use symmetric encryption.
(setq org-crypt-key nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5-16" class="outline-4">
<h4 id="sec-2-5-16"><span class="section-number-4">2.5.16</span> Create menu for org-mode entries (lacarte lets you reach it from the keyboard, too)</h4>
<div class="outline-text-4" id="text-2-5-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'org-mode-hook
          (lambda () (imenu-add-to-menubar "Imenu")))
(setq org-imenu-depth 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5-17" class="outline-4">
<h4 id="sec-2-5-17"><span class="section-number-4">2.5.17</span> Property shortcuts for collaboration: From-To</h4>
<div class="outline-text-4" id="text-2-5-17">
<p>
Note: searchable both with org-mode match: C-c / p and with icicles search,
org-icicle-occur or icicle-occur, here: C-c C-'
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-from ()
  "Set property 'FROM'."
  (interactive)
  (org-set-property "FROM" (ido-completing-read "From whom? " '("ab" "iz"))))

(defun org-to ()
  "Set property 'TO'."
  (interactive)
  (org-set-property "TO" (ido-completing-read "To whom? " '("ab" "iz"))))

(eval-after-load 'org
  '(define-key org-mode-map (kbd "C-c x f") 'org-from))
(eval-after-load 'org
  '(define-key org-mode-map (kbd "C-c x t") 'org-to))
</pre>
</div>
</div>
</div>
