user/iani.html

<div id="outline-container-sec-2-5-18" class="outline-4">
<h4 id="sec-2-5-18"><span class="section-number-4">2.5.18</span> <span class="done OBSOLETE">OBSOLETE</span> fname-find-file-standardized: Consistent multi-component filenames</h4>
<div class="outline-text-4" id="text-2-5-18">
<div class="org-src-container">

<pre class="src src-elisp">(defvar fname-parts-1-2 nil)
(defvar fname-part-3 nil)
(defvar fname-root "~/Dropbox/000Workfiles/2014/")
(defvar fname-filename-components
  (concat fname-root  "00000fname-filename-components.org"))

(defun fname-find-file-standardized (&amp;optional do-not-update-timestamp)
  (interactive "P")
  (unless fname-part-3 (fname-load-file-components))
  (setq *grizzl-read-max-results* 40)
  (let* ((root fname-root)
         (index-1 (grizzl-make-index
                   (mapcar 'car fname-parts-1-2)))
         (name-1 (grizzl-completing-read "Part 1: " index-1))
         (index-2 (grizzl-make-index (cdr (assoc name-1 fname-parts-1-2))))
         (name-2 (grizzl-completing-read "Part 2: " index-2))
         (index-3 (grizzl-make-index fname-part-3))
         (name-3 (grizzl-completing-read "Part 3: " index-3))
         (path (concat root name-1 "_" name-2 "_" name-3 "_"))
         (candidates (file-expand-wildcards (concat path "*")))
         extension-index extension final-choice)
    (setq final-choice
          (completing-read "Choose file or enter last component: " candidates))
    (cond ((string-match (concat "^" path) final-choice)
           (setq path final-choice))
      (t
       (setq extension (ido-completing-read
                        "Enter extension:" '("org" "el" "html" "scd" "sc" "ck")))
       (setq path (concat path final-choice
                          (format-time-string "_%Y-%m-%d-%H-%M" (current-time))
                          "." extension))))
    (find-file path)
    (unless do-not-update-timestamp
     (set-visited-file-name
      (replace-regexp-in-string
       "_[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}-[0-9]\\{2\\}-[0-9]\\{2\\}"
       (format-time-string "_%Y-%m-%d-%H-%M" (current-time)) path)))
    (kill-new (buffer-file-name (current-buffer)))))

(defun fname-load-file-components (&amp;optional keep-buffer)
  (interactive "P")
  (let ((buffer (find-file fname-filename-components)))
    (fname-load-file-components-from-buffer buffer)
    (unless keep-buffer (kill-buffer buffer)))
  (message "file component list updated"))

(defun fname-load-file-components-from-buffer (buffer)
  (set-buffer buffer)
  (setq fname-parts-1-2 nil)
  (setq fname-part-3 nil)
  (org-map-entries
   (lambda ()
     (let ((plist (cadr (org-element-at-point))))
       (cond
        ((equal (plist-get plist :level) 2)
         (setq fname-parts-1-2
               (append fname-parts-1-2
                       (list (list (plist-get plist :raw-value))))))
        ((equal (plist-get plist :level) 3)
         (setcdr (car (last fname-parts-1-2))
                 (append (cdar (last fname-parts-1-2))
                         (list (plist-get plist :raw-value))))))))
   "LEVELS1_2")
  (org-map-entries
   (lambda ()
     (let ((plist (cadr (org-element-at-point))))
       (when
           (equal 2 (plist-get plist :level))
         (setq fname-part-3
               (append fname-part-3 (list (plist-get plist :raw-value)))))))
   "LEVEL3"))

(defun fname-edit-file-components ()
  (interactive)
  (find-file fname-filename-components)
  (add-to-list 'write-contents-functions
               (lambda ()
                 (fname-load-file-components-from-buffer (current-buffer))
                 (message "Updated file name components from: %s" (current-buffer))
                 (set-buffer-modified-p nil)))
  ;; Debugging:
  (message "write-contents-functions of file %s are: %s"
           (buffer-file-name) write-contents-functions))
  (defun fname-menu ()
  (interactive)
  (let ((action (ido-completing-read
                 "Choose action: "
                 '("fname-edit-file-components"
                  "fname-load-file-components"
                  "fname-find-file-standardized"))))
    (funcall (intern action))))

(global-set-key (kbd "H-f f") 'fname-find-file-standardized)
(global-set-key (kbd "H-f m") 'fname-menu)
(global-set-key (kbd "H-f e") 'fname-edit-file-components)
(global-set-key (kbd "H-f l") 'fname-load-file-components)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-5-19" class="outline-4">
<h4 id="sec-2-5-19"><span class="section-number-4">2.5.19</span> Macro: toggle drawer visibility for this section;</h4>
<div class="outline-text-4" id="text-2-5-19">

<p>
See: <a href="http://stackoverflow.com/questions/5500035/set-custom-keybinding-for-specific-emacs-mode">http://stackoverflow.com/questions/5500035/set-custom-keybinding-for-specific-emacs-mode</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(fset 'org-toggle-drawer
   (lambda (&amp;optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([67108896 3 16 14 tab 24 24] 0 "%d")) arg)))

(eval-after-load 'org
  '(define-key org-mode-map (kbd "C-c M-d") 'org-toggle-drawer))
(eval-after-load 'org
  '(define-key org-mode-map (kbd "C-c C-'") 'org-edit-special))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-5-20" class="outline-4">
<h4 id="sec-2-5-20"><a id="ID-4534C8F5-207C-498B-B866-3F9DF319471F" name="ID-4534C8F5-207C-498B-B866-3F9DF319471F"></a><span class="section-number-4">2.5.20</span> org-export for docpad</h4>
<div class="outline-text-4" id="text-2-5-20">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-html-export-as-html-body-only ()
  "Export only the body. Useful for using the built-in exporter of Org mode
with the docpad website framework."
    (interactive)
    (let ((path
           (concat
            (file-name-sans-extension (buffer-file-name))
            ".html")))
      (message path)
      (org-html-export-as-html
          nil ;; async
          nil ;; subtreep
          nil ;; visible-only
          t   ;; body only
          ;; ext-plist (not given here)
          )
      (write-file path)
      (message (format "written to path: %s" path))))

(global-set-key (kbd "H-e H-b") 'org-html-export-as-html-body-only)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-5-21" class="outline-4">
<h4 id="sec-2-5-21"><span class="section-number-4">2.5.21</span> Internal: Load org-pm</h4>
<div class="outline-text-4" id="text-2-5-21">
<div class="org-src-container">

<pre class="src src-elisp">(org-babel-load-file "/Users/iani/Documents/Dev/Emacs/org-publish-meta/org-pm.org")
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Magit (git for emacs) Add git repositories)</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Magit config: Manage git repos from inside emacs
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq magit-repo-dirs
      '(
        "~/Dropbox/000WORKFILES/org"
        "~/Documents/Dev"
        "~/.emacs.d/personal"
))
</pre>
</div>
</div>
</div>
</div>
